text/19-db-query-lang.org
#+title: Chapter 19 : A language for querying databases

* <<intro>>

Datbas is a small language based on classical predicate logic, with predicates of any number of parameters.  It allows users to describe a finite interpretation and then to ask the system questions about this interpretation.  The system incorporates features of the Datalog system of Chapter 16 and the theorem prover for monadic logic developed in Chapter 15.  The implementation makes heavy use of the utilities developed in Chapter 17.

* Design of the language

In this section we design a language that is to be based on classical predicate calculus.  In this respect it is similar to the monadic logic system of Chapter 15.  But this system will allow predicates not with at most one parameter but with any number of parameters.  Whereas the monadic logic system determined whether a formula is a logical truth (or true in all interpretations), this system determines whether a formula is true in a particular interpretation.

The idea is that the user first specifies a finite /interpretation/ and then repeatedly asks the system whether particular formulas are true in the interpretation or which individuals in the interpretation satisfy particular formulas.  In this respect the system resembles Prolog (and its small cousin, Datalog, of Chapter 16).  However, the system to be designed here is entirely classical and hence its treatment of negation is quite different from that of Prolog's.  In particular, it will be possible to ask which individuals do /not/ satisfy an open formula.  Such a query would not be possible in Prolog because the domain is infinite (technically, it is the Herbrand universe of all terms), and hence the list of individuals which do not satisfy a formula will generally be infinite.  To make this list finite, the system to be developed here will require all individuals in the domain to be specifically listed.  Hence the domain of individuals and the extensions of predicates are relatively fixed, in a way that is similar to the Datalog system, and unlike the monadic logic system.

** Sorts and types

One decision that had to be made concerned whether all individuals should be of the same undifferentiated kind or sort, or whether there should be a system of /sort/s, somewhat similar to the typing system of languages such as Pascal or C.  Most of the familiar logics have just one kind or sort of individual, and hence quantifiers range over all individuals.  But there are advantages in having several sorts of individuals, and making all quantified variables range over some specified sort.

1. One advantage lies in additional security: the system can check whether the constraints imposed by the sorts are violated and then produce error messages.

2. The other advantage lies in execution speed. Consider an unsorted and a sorted system in which there are many things which are not people.  Now consider the query whether all people are healthy, wealthy and wise.  In the /unsorted system/ this question would be put as a universally quantified implication formula.  To determine the answer, the program would have to check through all the individuals in the domain to ascertain whether they are either not persons or are healthy, wealthy and wise.  In the /sorted system/ the same question would be expressed as a universally quantified formula, with the variable of quantification being typed to range over persons.  The remainder of the formula is just the consequent of the implication formula needed for the unsorted system.  So the antecedent of the unsorted formula becomes absorbed into the simultaneous quantification and typing of the variable.  To determine whether the formula is true, the program would merely have to check through the individuals of sort person to determine whether they are healthy, wealthy and wise.  If there are many individuals that are not persons, this difference in search space can be substantial.

The introduction of sorts requires that the variables in open formulas be typed in a way that is similar to the typing in quantifiers.  One solution is to introduce quasi-binders which are like quantifiers in that they assign a type to a variable, but which leave the variable unquantified and hence free.  One such quasi-binder is =WHICH=, and to a question beginning with =WHICH= the system should then respond with a list of those persons which satisfy the open formula.  Another quasi-binder is =FIRST=, used in a similar way to obtain not all individuals having a particular property but just one, the first that can be found.

3. The third advantage is minor, it has to do with finding individuals which do not have a particular property, i.e. individuals which satisfy a negated formula.  Consider the query

#+begin_example
        WHICH p:person  NOT happy(p)
#+end_example

It will only produce a list of persons who are not happy, and not cities, rivers and countries.

4. Finally, the introduction of sorts can save memory. Happiness is a property of some persons, but never of cities, rivers or planets.  So it is never necessary to store such information about those other things.

Sorts are very similar to /type/s, and often the two terms are used synonymously.  But there are good reasons to distinguish them.  In the literature one sometimes speaks of individuals in the domain having one or the other sort, and expressions, which refer to individuals, as having one or the other type.  This makes the notion of sort model-theoretic and the notion of type syntactic.  I shall speak of individuals having a particular sort, and variables and formal parameters as having a particular type.

