19-db-query-lang.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 19 : A language for querying databases</title>
<!-- 2013-05-31 Fri 19:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/etc/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 19 : A language for querying databases</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. Design of the language</a>
<ul>
<li><a href="#sec-2-1">2.1. Sorts and types</a></li>
<li><a href="#sec-2-2">2.2. Determinates and determinables</a></li>
<li><a href="#sec-2-3">2.3. Formal definitions</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. <i>Syntax</i>:</a></li>
<li><a href="#sec-2-3-2">2.3.2. <i>Semantics &#x2014; Interpretation</i>:</a></li>
<li><a href="#sec-2-3-3">2.3.3. <i>Semantics &#x2014; Satisfaction</i>:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. A sample run</a></li>
<li><a href="#sec-4">4. User manual</a></li>
<li><a href="#sec-5">5. The implementation</a>
<ul>
<li><a href="#sec-5-1">5.1. General and context free syntax</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. <i>Utilities</i>:</a></li>
<li><a href="#sec-5-1-2">5.1.2. <i>Main</i>:</a></li>
<li><a href="#sec-5-1-3">5.1.3. <i>Context free parsing and error recovery</i>:</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Context sensitive syntax</a></li>
<li><a href="#sec-5-3">5.3. <i>Step 1 - Symbol Table</i>:</a></li>
<li><a href="#sec-5-4">5.4. <i>Step 2:</i></a></li>
<li><a href="#sec-5-5">5.5. <i>Step 3:</i></a></li>
<li><a href="#sec-5-6">5.6. Semantics &#x2014; closed atomic formulas</a>
<ul>
<li><a href="#sec-5-6-1">5.6.1. <i>Predicates as truth functions</i>:</a></li>
<li><a href="#sec-5-6-2">5.6.2. <i>Linearising the array</i>:</a></li>
<li><a href="#sec-5-6-3">5.6.3. <i>A single array for all predicates</i>:</a></li>
<li><a href="#sec-5-6-4">5.6.4. <i>Extensions</i>:</a></li>
</ul>
</li>
<li><a href="#sec-5-7">5.7. Semantics &#x2014; variables</a>
<ul>
<li><a href="#sec-5-7-1">5.7.1. <i>Requirements</i>:</a></li>
<li><a href="#sec-5-7-2">5.7.2. <i>Implementing substitution</i>:</a></li>
<li><a href="#sec-5-7-3">5.7.3. <i>Verifying existentials</i>:</a></li>
<li><a href="#sec-5-7-4">5.7.4. <i>Verifying universals</i>:</a></li>
<li><a href="#sec-5-7-5">5.7.5. <i>Atoms with variables</i>:</a></li>
<li><a href="#sec-5-7-6">5.7.6. <i><code>THE</code> declarations</i>:</a></li>
</ul>
</li>
<li><a href="#sec-5-8">5.8. Semantics &#x2014; other aspects</a>
<ul>
<li><a href="#sec-5-8-1">5.8.1. <i>Logical operations</i>:</a></li>
<li><a href="#sec-5-8-2">5.8.2. <i>Sorts Used As Predicates</i>:</a></li>
<li><a href="#sec-5-8-3">5.8.3. <i>Identity Statements</i>:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. The program</a></li>
<li><a href="#sec-7">7. Exercises and reading</a>
<ul>
<li><a href="#sec-7-1">7.1. <i>Background Reading</i> :</a></li>
<li><a href="#sec-7-2">7.2. <i>Syntactic Sugar - condensed binding</i>:</a></li>
<li><a href="#sec-7-3">7.3. <i>Syntactic Sugar - non-identity</i>:</a></li>
<li><a href="#sec-7-4">7.4. <i>Closures</i>:</a></li>
<li><a href="#sec-7-5">7.5. <i>Functions</i>:</a></li>
<li><a href="#sec-7-6">7.6. <i>Determinables as predicates</i>:</a></li>
<li><a href="#sec-7-7">7.7. <i>Sparse Memory</i> :</a></li>
<li><a href="#sec-7-8">7.8. <i>Constraints instead of Sorts</i> :</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a id="intro" name="intro"></a></h2>
<div class="outline-text-2" id="text-1">
<p>
Datbas is a small language based on classical predicate logic, with predicates of any number of parameters.  It allows users to describe a finite interpretation and then to ask the system questions about this interpretation.  The system incorporates features of the Datalog system of Chapter 16 and the theorem prover for monadic logic developed in Chapter 15.  The implementation makes heavy use of the utilities developed in Chapter 17.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Design of the language</h2>
<div class="outline-text-2" id="text-2">
<p>
In this section we design a language that is to be based on classical predicate calculus.  In this respect it is similar to the monadic logic system of Chapter 15.  But this system will allow predicates not with at most one parameter but with any number of parameters.  Whereas the monadic logic system determined whether a formula is a logical truth (or true in all interpretations), this system determines whether a formula is true in a particular interpretation.
</p>

<p>
The idea is that the user first specifies a finite <i>interpretation</i> and then repeatedly asks the system whether particular formulas are true in the interpretation or which individuals in the interpretation satisfy particular formulas.  In this respect the system resembles Prolog (and its small cousin, Datalog, of Chapter 16).  However, the system to be designed here is entirely classical and hence its treatment of negation is quite different from that of Prolog's.  In particular, it will be possible to ask which individuals do <i>not</i> satisfy an open formula.  Such a query would not be possible in Prolog because the domain is infinite (technically, it is the Herbrand universe of all terms), and hence the list of individuals which do not satisfy a formula will generally be infinite.  To make this list finite, the system to be developed here will require all individuals in the domain to be specifically listed.  Hence the domain of individuals and the extensions of predicates are relatively fixed, in a way that is similar to the Datalog system, and unlike the monadic logic system.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Sorts and types</h3>
<div class="outline-text-3" id="text-2-1">
<p>
One decision that had to be made concerned whether all individuals should be of the same undifferentiated kind or sort, or whether there should be a system of /sort/s, somewhat similar to the typing system of languages such as Pascal or C.  Most of the familiar logics have just one kind or sort of individual, and hence quantifiers range over all individuals.  But there are advantages in having several sorts of individuals, and making all quantified variables range over some specified sort.
</p>

<ol class="org-ol">
<li>One advantage lies in additional security: the system can check whether the constraints imposed by the sorts are violated and then produce error messages.
</li>

<li>The other advantage lies in execution speed. Consider an unsorted and a sorted system in which there are many things which are not people.  Now consider the query whether all people are healthy, wealthy and wise.  In the <i>unsorted system</i> this question would be put as a universally quantified implication formula.  To determine the answer, the program would have to check through all the individuals in the domain to ascertain whether they are either not persons or are healthy, wealthy and wise.  In the <i>sorted system</i> the same question would be expressed as a universally quantified formula, with the variable of quantification being typed to range over persons.  The remainder of the formula is just the consequent of the implication formula needed for the unsorted system.  So the antecedent of the unsorted formula becomes absorbed into the simultaneous quantification and typing of the variable.  To determine whether the formula is true, the program would merely have to check through the individuals of sort person to determine whether they are healthy, wealthy and wise.  If there are many individuals that are not persons, this difference in search space can be substantial.
</li>
</ol>

<p>
The introduction of sorts requires that the variables in open formulas be typed in a way that is similar to the typing in quantifiers.  One solution is to introduce quasi-binders which are like quantifiers in that they assign a type to a variable, but which leave the variable unquantified and hence free.  One such quasi-binder is <code>WHICH</code>, and to a question beginning with <code>WHICH</code> the system should then respond with a list of those persons which satisfy the open formula.  Another quasi-binder is <code>FIRST</code>, used in a similar way to obtain not all individuals having a particular property but just one, the first that can be found.
</p>

<ol class="org-ol">
<li>The third advantage is minor, it has to do with finding individuals which do not have a particular property, i.e. individuals which satisfy a negated formula.  Consider the query
</li>
</ol>

<pre class="example">
WHICH p:person  NOT happy(p)
</pre>

<p>
It will only produce a list of persons who are not happy, and not cities, rivers and countries.
</p>

<ol class="org-ol">
<li>Finally, the introduction of sorts can save memory. Happiness is a property of some persons, but never of cities, rivers or planets.  So it is never necessary to store such information about those other things.
</li>
</ol>

<p>
Sorts are very similar to /type/s, and often the two terms are used synonymously.  But there are good reasons to distinguish them.  In the literature one sometimes speaks of individuals in the domain having one or the other sort, and expressions, which refer to individuals, as having one or the other type.  This makes the notion of sort model-theoretic and the notion of type syntactic.  I shall speak of individuals having a particular sort, and variables and formal parameters as having a particular type.
</p>
</div>
</div>
