19-db-query-lang.html
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Determinates and determinables</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The usual predicates of logic are often called /truth function/s.  This is because when supplied with parameters they yield a truth value.  For example, a unary predicate is either true of an individual or it is not &#x2014; there is no third possibility.  The resultant truth value can then become an operand to the truth functional operators.
</p>

<p>
For many purposes it is useful to have a family of mutually exclusive and jointly exhaustive predicates.  One might want to speak of men, women and children, and one may want it understood that every person belongs to exactly one of these categories.  What is being understood here can be expressed explicitly by meaning postulates which state that the three categories are mutually exclusive and, within the sort person, jointly exhaustive.  Then from the fact that somebody is neither a man nor a woman we may infer that we are dealing with a child.  But the meaning postulates can complicate the deduction mechanism considerably.
</p>

<p>
In the case of unary predicates like the above, another solution is to define the three categories as sorts, and then to define the type person as the union of these three sorts.  If sort names can also be used as predicates, this method takes care of the required deductions without explicit meaning postulates.
</p>

<p>
But the method cannot work with families of relations, predicates taking more than one parameter.  For example, one might want to categorise the attitude of one person to another as loving, friendly, indifferent, disdainful or hostile.  As we all learnt when young, often to our sorrow, the relationships are not symmetric.  No system of sorts of individuals can cope with this, since sorts are classes of individuals, and not classes of ordered pairs of individuals.  Hence families of mutually exclusive and jointly exhaustive predicates require a separate treatment.  Indeed, one can have families without sorts, or vice versa, or one can have neither or both.
</p>

<p>
Another possible way of dealing with the problem is to have a sort comprising these five attitudes and to regard human relationships not as a binary relation between two people, but as a ternary relation between two persons and an attitude.  But this turns the five attitudes into individuals, and this is at least philosophically suspect.
</p>

<p>
So it seems that families of predicates need a separate treatment.  Following an older usage, I shall call the human relationship a <i>determinable</i>, and it has five <i>determinate</i> values.  An ordinary predicate has just two values, the truth values, and a determinable predicate can have any positive number of values.  The determinates of a given determinable are just two-valued predicates, but they are automatically mutually exclusive and jointly exhaustive.
</p>

<p>
Once there are determinables, it seems natural to allow <i>variable</i>\s to range over the determinates of a determinable.  These variables can be universally or existentially quantified, or they can occur in <code>WHICH</code> or <code>FIRST</code> queries.  The variables have to be typed just like individuals variables, and the type of such a predicate variable is the determinable over whose determinates the variable is to range.  Syntactically there need not be anything to distinguish the declaration of a <i>predicate variable</i> from the declaration of an <i>individual variable</i>.  But within the scope of such a declaration, the predicate variable behaves just like a determinate predicate.  Semantically an existential quantification using a predicate variable behaves just like a disjunction of several copies of the formula being quantified, with each of the determinate predicates substituted for the predicate variable.  Universal quantifications behave just like conjunctions.  For <code>WHICH</code> queries the system should respond by listing the determinates that make the formula true, and for <code>FIRST</code> queries it should list only the first such determinate that it can find.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Formal definitions</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <i>Syntax</i>:</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
The predicate language to be used will need the usual truthfunctional connectives, predicate constants and individual constants, individual variables and quantifiers.  In addition there will have to be /sort constant/s, which are similar to predicate constants except that they are defined by enumerations of the individuals they comprise, and later used in quantifications and questions.  To anticipate the concrete syntax to be used later, here are some examples:
</p>

<pre class="example">
person = (peter paul mary)              definition
ALL x:person (rich(x) IMP happy(x))     use in quantification
WHICH y:person rich(y)                  use in question
</pre>

<p>
This method allows variables such as <code>x</code> and <code>y</code> to be used with any type name, and the variable acquires its type at the point of quantification and retains this type throughout the scope of that quantification except where overridden by more local quantifications.  Another method is to type the variables once and for all, as in, say,
</p>

<pre class="example">
x,y : person = (peter paul mary)
</pre>

<p>
This would simultaneously give an extension to the type person and allow variables <code>x</code> and <code>y</code> to range over these persons.  Then one would write:
</p>

<pre class="example">
ALL x SOME y likes(x,y)
</pre>

<p>
The variables <code>x</code> and <code>y</code> would be automatically typed.
But this method will not be used here.
</p>

<p>
All predicates will have to be typed by the types of their parameters.  Assuming that persons and cities have been declared as sorts, one might declare happy to be a predicate which takes a person as a parameter, lives-in as a predicate which takes two parameters, a person and a city, and bigger as a predicate which takes two cities as parameters.  In the concrete syntax these declarations might appear as:
</p>

<pre class="example">
happy(person)
lives-in(person,city)
bigger(city,city)
</pre>

<p>
For determinable predicates it is necessary to list the determinates, the mutually exclusive and jointly exhaustive predicates.
</p>

<pre class="example">
attitude(person,person) =
    { loving friendly indifferent disdainful hostile }
</pre>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> <i>Semantics &#x2014; Interpretation</i>:</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
An interpretation consists of a <i>domain</i> of individuals and for each predicate an <i>extension</i> of the predicate.  The domain is subdivided into one or more exclusive subdomains or <i>sort/s.  Each sort is a set of individuals, and each individual belongs to just one sort.  The domain comprises the union of all the sorts.  A /type</i> is a union of one or more sorts.  Each predicate has a fixed number of formal parameters, and each parameter is of a particular type.  Each predicate of n parameters has as its extension a set of n-tuples of individuals, where the sort of each individual is a subset of the type of the corresponding formal parameters.
</p>

<p>
The system to be implemented here does not use individual constants that are different from the names of the individuals.  So, every individual constant has as its extension the individual which it names, and every individual has exactly one individual constant of which it is the extension.
</p>
</div>
</div>
