text/19-db-query-lang.org
*** /Semantics --- Satisfaction/:
This is more complicated than for monadic logic because there can be any number of variables in a formula.  These variables have to be given extensions, and hence satisfaction is not a relation between an individual and a formula but a relation between a sequence of individuals and a formula.  Such a sequence of individuals is always used to interpret variables in a formula.  More formally, a sequence is a mapping from the variables in a formula to individuals in the domain.  (To anticipate the implementation, the sequence is the content of the stack.)

First, the definition of satisfaction between a sequence of individuals and an atomic formula.  In the notation to be used here, the formula might be =p(a,y,b,x)=, which is formed from a predicate, here the 4-place predicate =p=, followed by a parenthesised 4-tuple, of constants, here =a= and =b=, and variables, here =x= and =y=.  First we form a 4-tuple of individuals: For each constant such as =a= and =b= we use the individual which it denotes.  For each variable such as =x= and =y= we use the individual which the sequence assigns to them --- they might be =a= for =x= and =c= for =y=.  This gives a 4-tuple of individuals =<a,c,b,a>= of individuals.  Then we check whether this 4-tuple of individuals is in the extension of the predicate =p=.  If it is, then the sequence satisfies the atomic formula, otherwise it does not.

There is also the special case of an atomic formula, say =s(x)= or =s(a)= in which =s= is a sort.  Then a given sequence satisfies =s(x)= if and only if it assigns to =x= an individual of sort =s=, and any sequence satisfies =s(a)= if an only if the constant a denotes an individual of sort =s=.

Next, satisfaction for truth-functionally compound formulas:

- A sequence satisfies a negation if and only if it does not satisfy the negand,
- it satisfies a conjunction if and only if it satisfies both conjuncts,
- it satisfies a disjunction if and only if it satisfies at least one disjunct,
- it satisfies a conditional if and only if either it does not satify the antecedent or it satisfies the consequent,
- and it satisfies an equivalence if and only if either it satisfies both or satisfies neither parts.

Finally, satisfaction for universally or existentially quantified formulas.  These are of the form =ALL v:t F= or =SOME v:t F= where =t= is a type and hence =v= is being declared to be a variable of type =t=.  For a given sequence we have to form the set of /v-variants/ of the sequence, the set of those sequences which are like the given sequence except that they may differ from the given one in what they assign to the variable =v=.  A given sequence satisfies the universally quantified formula if and only if all =v=-variants of the sequence satisfy =F=.  A given sequence satisfies the existential quantified formula if and only if at least one =v=-variant of the sequence satisfies =F=.

