19-db-query-lang.html
<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> <i>Semantics &#x2014; Satisfaction</i>:</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
This is more complicated than for monadic logic because there can be any number of variables in a formula.  These variables have to be given extensions, and hence satisfaction is not a relation between an individual and a formula but a relation between a sequence of individuals and a formula.  Such a sequence of individuals is always used to interpret variables in a formula.  More formally, a sequence is a mapping from the variables in a formula to individuals in the domain.  (To anticipate the implementation, the sequence is the content of the stack.)
</p>

<p>
First, the definition of satisfaction between a sequence of individuals and an atomic formula.  In the notation to be used here, the formula might be <code>p(a,y,b,x)</code>, which is formed from a predicate, here the 4-place predicate <code>p</code>, followed by a parenthesised 4-tuple, of constants, here <code>a</code> and <code>b</code>, and variables, here <code>x</code> and <code>y</code>.  First we form a 4-tuple of individuals: For each constant such as <code>a</code> and <code>b</code> we use the individual which it denotes.  For each variable such as <code>x</code> and <code>y</code> we use the individual which the sequence assigns to them &#x2014; they might be <code>a</code> for <code>x</code> and <code>c</code> for <code>y</code>.  This gives a 4-tuple of individuals <code>&lt;a,c,b,a&gt;</code> of individuals.  Then we check whether this 4-tuple of individuals is in the extension of the predicate <code>p</code>.  If it is, then the sequence satisfies the atomic formula, otherwise it does not.
</p>

<p>
There is also the special case of an atomic formula, say <code>s(x)</code> or <code>s(a)</code> in which <code>s</code> is a sort.  Then a given sequence satisfies <code>s(x)</code> if and only if it assigns to <code>x</code> an individual of sort <code>s</code>, and any sequence satisfies <code>s(a)</code> if an only if the constant a denotes an individual of sort <code>s</code>.
</p>

<p>
Next, satisfaction for truth-functionally compound formulas:
</p>

<ul class="org-ul">
<li>A sequence satisfies a negation if and only if it does not satisfy the negand,
</li>
<li>it satisfies a conjunction if and only if it satisfies both conjuncts,
</li>
<li>it satisfies a disjunction if and only if it satisfies at least one disjunct,
</li>
<li>it satisfies a conditional if and only if either it does not satify the antecedent or it satisfies the consequent,
</li>
<li>and it satisfies an equivalence if and only if either it satisfies both or satisfies neither parts.
</li>
</ul>

<p>
Finally, satisfaction for universally or existentially quantified formulas.  These are of the form <code>ALL v:t F</code> or <code>SOME v:t F</code> where <code>t</code> is a type and hence <code>v</code> is being declared to be a variable of type <code>t</code>.  For a given sequence we have to form the set of <i>v-variants</i> of the sequence, the set of those sequences which are like the given sequence except that they may differ from the given one in what they assign to the variable <code>v</code>.  A given sequence satisfies the universally quantified formula if and only if all <code>v</code>-variants of the sequence satisfy <code>F</code>.  A given sequence satisfies the existential quantified formula if and only if at least one <code>v</code>-variant of the sequence satisfies <code>F</code>.
</p>
</div>
</div>
</div>
</div>
