19-db-query-lang.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A sample run</h2>
<div class="outline-text-2" id="text-3">
<p>
The following is a sample run of the program.  The first part consists of a very small database about people and countries, and some queries.  The second consists of a larger database concerning the geography of Australia, and some queries.
</p>

<pre class="example">
   1    %LISTING 1
   2    %STATISTICS 1
   3    %INCLUDE 43datba1.db
   1    SORT
   2        person  =  (peter paul mary);
   3        country  =  (china brazil italy);
   4        entity  =  person | country.
   5    PREDICATE
   6        tall(person);
   7        likes(person,entity).
   8    EXTENSION
   9        tall = { &lt;peter&gt; &lt;mary&gt; };
  10        likes = { &lt;peter,mary&gt; &lt;mary,paul&gt; &lt;mary,mary&gt;
  11                  &lt;peter,china&gt; &lt;peter,italy&gt;
  12                  &lt;paul,italy&gt; &lt;mary,brazil&gt; }.
  13    WHICH x:entity likes(peter,x).
        1:
            x = mary
        2:
            x = china
        3:
            x = italy
        yes
  14    SOME p:person (tall(p) AND likes(p,brazil)).
        1:
        yes
  15    WHICH p:person likes(p,p).
        1:
            p = mary
        yes
   4    %INCLUDE 43australia.db
   1    (* GEOGRAPHICAL DATABASE FOR AUSTRALIA *)
   2
   3    SORT
   4
   5    statename =
   6      ( Western_Australia  Northern_Territory  Queensland
   7        New_South_Wales  Australian_Capital_Territory
   8        South_Australia  Victoria  Tasmania );
   9    city =
  10      ( Perth  Fremantle  Albany  Coolgardie  Kalgoorlie
  11        Darwin  Port_Essington  Alice_Springs
  12        Brisbane  York  Cooktown  Townsville  Rockhampton
  13        Sydney  Newcastle  Broken_Hill  Bathurst  Albury
  14        Canberra
  15        Adelaide  Port_Augusta
  16        Melbourne  Ballarat  Bendigo  Geelong
  17        Hobart  Launceston );
  18    river =
  19      ( Fitzroy  Daly  Georgina  Warburton
  20        Coopers_Creek  Flinders  Darling  Murray );
  21    state =
  22      ( WA  NT  QUE  NSW  ACT  SA  VIC  TAS );
  23    city_or_state =
  24        city | state.
  25
  26    PREDICATE
  27
  28    big(city_or_state);
  29    eastern_statename(statename);
  30    abbreviation(statename, state);
  31    capital_of(city, state);
  32    flows_through(river, state);
  33    borders(state,state);
  34    climate(state) = { hot warm temperate cold }.
  35
  36    EXTENSION
  37
  38    big =
  39      { &lt;Sydney&gt; &lt;Melbourne&gt; &lt;WA&gt; &lt;NT&gt; &lt;QUE&gt; &lt;NSW&gt; };
  40    eastern_statename =
  41      { &lt;Queensland&gt;  &lt;New_South_Wales&gt;
  42        &lt;Australian_Capital_Territory&gt;  &lt;Victoria&gt; };
  43    abbreviation =
  44      { &lt;Western_Australia,WA&gt;  &lt;Northern_Territory,NT&gt;
  45        &lt;Queensland,QUE&gt;  &lt;New_South_Wales,NSW&gt;
  46        &lt;Australian_Capital_Territory,ACT&gt;
  47        &lt;South_Australia,SA&gt;  &lt;Victoria,VIC&gt;  &lt;Tasmania,TAS&gt; };
  48    capital_of =
  49      { &lt;Perth,WA&gt;  &lt;Darwin,NT&gt;  &lt;Brisbane,QUE&gt;  &lt;Sydney,NSW&gt;
  50        &lt;Canberra,ACT&gt;  &lt;Adelaide,SA&gt;  &lt;Melbourne,VIC&gt;
  51        &lt;Hobart,TAS&gt; };
  52    flows_through =
  53      { &lt;Fitzroy,WA&gt; &lt;Daly,NT&gt; &lt;Georgina,NT&gt; &lt;Georgina,SA&gt;
  54        &lt;Warburton,QUE&gt; &lt;Warburton,SA&gt; &lt;Coopers_Creek,QUE&gt;
  55        &lt;Coopers_Creek,SA&gt; &lt;Flinders,QUE&gt; &lt;Darling,NSW&gt;
  56        &lt;Darling,SA&gt; &lt;Murray,NSW&gt; &lt;Murray,VIC&gt; };
  57    borders =
  58      { &lt;WA,NT&gt; &lt;WA,SA&gt; &lt;NT,QUE&gt; &lt;NT,SA&gt; &lt;QUE,SA&gt; &lt;QUE,NSW&gt;
  59        &lt;NSW,SA&gt; &lt;NSW,ACT&gt; &lt;NSW,VIC&gt; &lt;NSW,SA&gt; &lt;SA,VIC&gt; };
  60    borders = (* NOW MAKE borders A SYMMETRIC RELATION *)
  61      { THE &lt;a:state,b:state&gt; borders(a,b) OR borders(b,a) };
  62    hot = { &lt;NT&gt; &lt;QUE&gt; };
  63    warm = { &lt;WA&gt; &lt;NSW&gt; &lt;SA&gt; };
  64    temperate = { &lt;ACT&gt; &lt;VIC&gt; };
  65    cold = { &lt;TAS&gt; }.
  66
  67
  68    WHICH s: statename NOT (eastern_statename(s) OR s = Tasmania).
        1:
            s = Western_Australia
        2:
            s = Northern_Territory
        3:
            s = South_Australia
        yes
  69    WHICH s:statename SOME a:state
  70        (capital_of(Melbourne,a) AND abbreviation(s,a)).
        1:
            s = Victoria
        yes
  71
  72    WHICH c:city SOME a:state
  73        (abbreviation(New_South_Wales,a) AND capital_of(c,a)).
        1:
            c = Sydney
        yes
  74    SOME r:river flows_through(r,QUE).
        1:
        yes
  75    ALL a:state SOME r:river flows_through(r,a).
        no
  76    SOME r:river flows_through(r,ACT).
        no
  77    WHICH a:state borders(a,NSW).
        1:
            a = QUE
        2:
            a = ACT
        3:
            a = SA
        4:
            a = VIC
        yes
  78    WHICH a:state borders(NSW,a).
        1:
            a = QUE
        2:
            a = ACT
        3:
            a = SA
        4:
            a = VIC
        yes
  79    WHICH r:river WHICH s:statename (* r entirely in s *)
  80      SOME s0:state
  81        ( flows_through(r,s0) AND
  82          ALL s1:state (flows_through(r,s1) IMP s1 = s0) AND
  83          abbreviation(s,s0) ).
        1:
            r = Fitzroy
            s = Western_Australia
        2:
            r = Daly
            s = Northern_Territory
        3:
            r = Flinders
            s = Queensland
        yes
  84    WHICH s:state (* borders three states *)
  85      SOME s1:state SOME s2:state SOME s3:state
  86        ( borders(s,s1) AND borders(s,s2) AND borders(s,s3) AND
  87          NOT (s1 = s2 OR s1 = s3 OR s2 = s3) ).
        1:
            s = NT
        2:
            s = QUE
        3:
            s = NSW
        4:
            s = SA
        yes
  88
  89    WHICH s:state temperate(s).
        1:
            s = ACT
        2:
            s = VIC
        yes
  90    WHICH s:state NOT(cold(s) OR temperate(s)).
        1:
            s = WA
        2:
            s = NT
        3:
            s = QUE
        4:
            s = NSW
        5:
            s = SA
        yes
  91    (* NOW variables ranging over determinables *)
  92    WHICH c:climate c(VIC).
        1:
            c = temperate
        yes
  93    FIRST c1:climate FIRST c2:climate
  94      FIRST s1:state FIRST s2:state
  95        ( c1(s1) AND c2(s2) AND borders(s1,s2) ).
        1:
            c1 = hot
            c2 = hot
            s1 = NT
            s2 = QUE
        yes
  96    FIRST c1:climate FIRST c2:climate
  97      FIRST s1:state FIRST s2:state
  98        ( c1(VIC) AND c1(s1) AND c2(s2) AND borders(s1,s2) ).
        1:
            c1 = temperate
            c2 = warm
            s1 = ACT
            s2 = NSW
        yes
  99    ALL c:climate SOME s:state c(s).
        1:
        yes
 100    ALL c:climate SOME s1:state  SOME s2:state
 101      ( NOT s1 = s2 AND c(s1) AND c(s2) ).
        no
 102    (* FIND climates  WHICH AT LEAST 3 STATES HAVE *)
 103    WHICH c:climate SOME s1:state SOME s2:state SOME s3:state
 104      ( NOT (s1 = s2 OR s1 = s3 OR s2 = s3)
 105        AND c(s1) AND c(s2) AND c(s3) ).
        1:
            c = warm
        yes
 106    (* FIND A climate WHICH ONLY ONE STATE HAS *)
 107    WHICH c:climate ALL s1:state ALL s2:state
 108        ( c(s1) AND c(s2) IMP s1 = s2 ).
        1:
            c = cold
        yes
 109    WHICH x:city_or_state big(x).
        1:
            x = Sydney
        2:
            x = Melbourne
        3:
            x = WA
        4:
            x = NT
        5:
            x = QUE
        6:
            x = NSW
        yes
 110
 111    (*  This query requires about 75% of the time: *)
 112    WHICH s:state
 113      SOME s1:state SOME s2:state SOME s3:state SOME s4:state
 114        ( borders(s,s1) AND borders(s,s2) AND
 115          borders(s,s3) AND borders(s,s4) AND
 116          NOT ( s1 = s2 OR s1 = s3 OR s1 = s4 OR
 117                s2 = s3 OR s2 = s4 OR s3 = s4 ) ).
        1:
            s = NSW
        2:
            s = SA
        yes
   5    QUIT.
660 milliseconds CPU
101143 calls to make
</pre>
</div>
</div>
