19-db-query-lang.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> User manual</h2>
<div class="outline-text-2" id="text-4">
<p>
The DATBAS system is a database and reasoning system based on classical logic over many-sorted domains.
</p>

<p>
The system permits declarations of sorts and the individuals they comprise, of predicates and the types of their parameters, and of extensions of predicates.  The system does not distinguish between individuals and individual constants.  Hence in a declaration of a sort the names listed are simultaneously the metalanguage names of the individuals in the interpretation and the object language individual constants which have those individuals as their extension.
</p>

<p>
The <i>grammar</i> of the input language is as follows:
</p>

<pre class="example">
session  ::=
    [ top-level ]
top-level  ::=
    "SORT"       [ identifier "=" type ";" ]  |
    "PREDICATE"  [ identifier { "(" type [ "," type ] ") } ]  |
    "EXTENSION"  [ identifier "="
        "{"  ( "THE" [ "&lt;" [ binding ] "&gt;"  expression  |
             [ "&lt;" tuple "&gt;" ]  "}"
    "SHOW"  |
    "QUIT"
    query
</pre>

<p>
A session consists of any number of top level commands.
A top level command is either
a declaration of =SORT=s or of =PREDICATE=s or
it is a specification of <code>EXTENSION=s,
or it is a request to =SHOW</code> the declared identifiers
or to <code>QUIT</code> the session,
or it is a query.
Each declaration consists of one of three keywords
followed in each case by zero or more identifiers being declared.
Any identifier being declared here
must not have been previously declared.
For declarations of <code>SORT=s,
each identifier is followed by ==</code> and then a type.
For a specification of =PREDICATE=s,
each identifier is optionally followed
by a parenthesised comma-separated list of types.
For declarations of  <code>EXTENSION=s
each identifier is followed by ==</code> and then an expression;
this is then followed by the specification of a set
enclosed in braces.
Such a specification is given either intensionally
or extensionally.
An intensional specification consists
of the word <code>THE</code> followed by a sequence
of (lambda-bound) typed variables enclosed
in corners, and then an expression.
An extensional specification consists
of any number of tuples of individuals
enclosed in corners.
</p>

<pre class="example">
type  ::=  ("(" [identifier] ")"  |  identifier)  { "|" type }
</pre>

<p>
A type is either a parenthesised list of identifers, or an identifier.  In the first case the identifiers will be entered as names of individuals in the domain, in the second case the identifier has to be a sort name.  A type can be further followed by <code>|</code> and another type, but that has to be of the second kind.
</p>

<pre class="example">
query  ::=
    ( "WHICH" | "FIRST" ) binding query  |
    expression
</pre>

<p>
A query consists of either a <code>WHICH</code> (or <code>FIRST</code>) question or just an expression.  A <code>WHICH</code> question such as <code>WHICH x:person likes(x,john)</code> produces those persons who like John.  A <code>WHICH</code> (or <code>FIRST</code>) question binds a variable to a type and otherwise consists of a query.  These bindings are similar to the quantifier bindings produced by <code>ALL</code> and <code>SOME</code>.  The syntax of the two kinds of bindings is chosen so that any combination is allowed except that a <code>WHICH</code> binding cannot occur in the scope of a quantifier binding and it cannot occur in a truth functionally compound formula.  The reason for this restriction is semantic: there seems to be no sensible meaning one could assign to aberrant expressions such as
</p>

<pre class="example">
ALL x:t1 (WHICH y:t2 r(x,y)  AND  WHICH z:t3 r(z,x))
</pre>

<p>
The requirement is achieved by insisting that <code>WHICH</code> and <code>FIRST</code> bindings occur outermost, as it is enforced by the above production.
</p>

<pre class="example">
binding  ::=  identifier ":" type
</pre>

<p>
A binding consists of an identifier, then a colon <code>:</code> and a type.  The identifier will be bound to the type.
</p>

<pre class="example">
expression  ::=
    simp_expression  [("IFF" | "IMP") simp_expression]
simp_expression  ::=
    term  ["OR" term]
term  ::=
    factor  ["AND" factor]
</pre>

<p>
An expression consists of one or more simple expressions separated by the truth functional operators <code>IMP</code> or <code>IFF</code>, for material implication and material equivalence.  A simple expression consists of one or more terms separated by the truth functional <code>OR</code> operator for inclusive disjunction.  A term consists of one or more factors separated by the truth functional <code>AND</code> operator for conjunction.
</p>

<pre class="example">
factor  ::=
    identifier { "(" identifier [ "," identifier ] ")" }  |
    identifier "(" identifier ")"  |
    identifier "=" identifier  |
    ( "ALL" | "SOME" ) binding factor  |
    "TRUE" | "FALSE"  |
    "NOT" factor  |
    "(" expression ")
</pre>

<p>
A factor can consist of an identifier optionally followed by a parenthesised sequence of comma-separated identifers.  The identifier must have been previously declared as a predicate, and the length of the sequence of identifiers or actual parameters must be equal to the number of formal parameters of the predicate, and each actual parameter of the sequence must be of a type that is a subtype of the corresponding formal parameter.  A factor can also consist of an identifier followed by an identifier in parentheses.  The first identifier must have been declared as a sort, and the second identifier must be a constant or a variable whose type is a supertype of the sort.  A factor can also consist of two identifiers separated by the identity symbol.  Each of the two identifiers can be a constant or a variable.  A factor may also consist of one of the binding symbols <code>ALL</code>, <code>SOME</code> or <code>THE</code>, followed by a binding and a factor.  A factor may also consist of curly braces enclosing zero or more tuples each consisting of angle corners enclosing a sequence.  Finally, a factor may consist of the symbols <code>TRUE</code> or <code>FALSE</code>, or <code>NOT</code> followed by a factor, or a parenthesised expression.
</p>

<p>
The scopes of bindings are as follows: In declarations of <code>EXTENSION=s any =THE</code>-binding extends to the end of the expression.  In a query any <code>WHICH</code>- or <code>FIRST</code>-binding extends to the end of the query.  In a factor, any <code>ALL</code>- or <code>SOME</code>-binding extends to the end of the factor.

</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The implementation</h2>
<div class="outline-text-2" id="text-5">
<p>
The context free syntax is so simple that it needs little discussion except for error recovery.  The context sensitive syntax and the semantics is described in detail.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> General and context free syntax</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> <i>Utilities</i>:</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Just as the program in the previous chapter, this program makes use of the utilities almost everywhere.  So again the utilities have to be processed by the Pascal compiler before the program proper can be processed.  Since the utilities are not entirely stand alone, several declarations have to occur first.  Most of these declarations are sufficiently similar to those in the previous chapter that it is not necessary to discuss them here.
</p>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> <i>Main</i>:</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
The main program begins by calling an initialisation procedure whose body consists of calls to procedures in the utilities: one call to initialise the scanner, several calls to enter the reserved symbols, and several calls to enter the standard identifiers.  The main program then enters its principal read-execute loop.
</p>
</div>
</div>
