text/19-db-query-lang.org
*** /Context free parsing and error recovery/:
As in most programs before, the recursive descent parsing procedures are modelled on the productions of the grammar.  Visibility requirements are met by the the following nesting structure:

#+begin_example
        top-level
            typ
            bind
            tuple
            expression
                simple-expression
                    term
                        factor
            query
#+end_example

Error detection is as usual, but this program also does a little more than just detect the first error.  Ideally a program should be able to determine the user's intent, and perhaps do what is called error /repair/.  But this is far too difficult.  Instead, this program does error /recovery/: rather than aborting after the first error, it continues as best it can, if necessary skipping a few symbols so that the parser can synchronise with the input.  The method is described in Wirth (1976, pp 320 - 330), and the program given below is based on the one given by Wirth.  So only a brief summary of the method will be given here.  Essentially every parsing procedure is given a value parameter which is a set of symbols.  At any one time, the current set contains precisely those symbols which may follow the non-terminal being parsed.  For the initial call, the actual parameter is a set containing just the terminating symbol period =.=.  For every procedure which parses infix symbols, any calls in that procedure augment the set by precisely the infix symbols parsed by that procedure.  For other procedures, such as those for parsing factors, a test is made at the end to check that the factor that has been parsed is indeed followed by a legal symbol --- if not, input symbols are skipped until a legal one is found.  Note that the parsing procedures for infix operators again do not follow the grammar verbatim, this helps to generate right linear trees for the code.

** Context sensitive syntax

The parser has to do more context sensitive checking than was necessary in previous programs.  All of this will be handled by a symbol table and another table for the formal parameters of predicates.  To summarise from the manual: 1: In declarations of sorts, individuals and predicates any identifiers must not have been previously declared.  Note that this does not apply to variables introduced by queries or by quantifications.  In use, i.e. outside declarations, any identifier must have been previously declared.  2: In use any identifier must be the right kind of object --- a constant or a variable, a type or a predicate.  3: In use a predicate must have the right number of actual parameters, and each actual parameter must be compatible with its corresponding formal parameter.  Similarly, in extensions of predicates given by =THE= declarations and an expression, the type of each declaration must be compatible with the formal parameters of the predicate.

These requirements are rather standard for many programming languages.  Requirements 1 and 2 we have encountered earlier, they are most readily implemented by means of a symbol table.  Requirement 3 will be implemented by a further table of parameters.  The parts of the program needed to satisfy the three requirements are best described in three separate steps.

** /Step 1 - Symbol Table/:
For the handling of user defined identifiers it is necessary to use a symbol table.  Two procedures are used to manipulate it: one to /enter/ new symbols into the table, another to /lookup/ symbols to retrieve information associated with them.  When a symbol is being declared, the =enter= procedure is used to enter the symbol itself.  When a symbol has been read which the scanner (in the utilities) does not recognise as a reserved word, the =lookup= procedure is used to retrieve information associated with the symbol.  Users can declare symbols in any order, so it is not possible to implement the binary search that works so well with fixed collections of symbols such as reserved words.  In previous programs the table of user defined symbols was always implemented as a simple linear list (or, in the case of Datalog, as three different linear lists).  The same method was used in the early stages of the development of this program.  The table was an array with an associated index initially set to zero.  Procedure =enter= incremented this index and deposited relevant information at the indexed position, and procedure =lookup= performed a linear search (with sentinel) starting at the most recent entry.

In any but the most trivial applications the number of individuals in SORT declarations will be quite large.  Since each individual requires an entry in the symbol table, the linear search method would become too slow.  To gain efficiency, the linear method can be replaced by a /hash/ method.  For some references, see Wirth (1976, pp 264 - 274), Tremblay and Bunt (1979, pp 531 - 549), or any good book on data structures or on compilers.  The method used here is called direct or separate chaining.  Essentially the identifier is used to compute a small number in a range from 1 to N, where N may be, say, 100 or 1000, but a prime number is best.  The method used here is dependent on the implementation of Pascal.  The hashing function first copies the identifier, a string of 16 bytes, into a record which in one of its variants is such a string.  In another variant the record consists of four integers, each of four bytes.  The four integers are simply added, producing a sum (implicitly modulo maxint) and then the modulus of the prime number N is taken.  The resulting number is then used to index into an =ARRAY [0 .. N]=, containing the starting point of a (quite short) linked list of those identifiers in the symbol table which yield the same hash value.  That list can then be searched linearly, by passing along link fields in the records.  The hash method can be implemented on top of the earlier linear search method, by adding the hash array as a new global data structure and by adding the link field to the records of the table.  Only the enter and the =lookup= procedures needed some small changes.  For debugging it was found useful to make the initial size of the prime number N and hence the hashtable absurdly small, say 13, to maximise the chances of collisions.

The number of symbols that are declared as individuals, sorts and predicates can be large, and the scope of the declarations is always the remainder of the session.  Importantly, these declarations never have to be undone, and in such a situation the hash method works very well.  However, there are also variables that are introduced in queries and in quantifications.  These always have a very limited scope, and at the end of that scope they are not wanted any further.  Indeed, it would be good if the space they have used can be re-used.  But removing symbols from a hash table can be tedious.  Fortunately at any one time the number of active variables with limited scope is very small.  Hence they can be searched linearly before the remainder of the symbol table is hash searched.  The deletion of these symbols is done by simply resetting an index variable.

