19-db-query-lang.html
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <i>Step 2:</i></h3>
<div class="outline-text-3" id="text-5-4">
<p>
The symbol table as described above can be used to enter symbols into the table and to lookup to see whether the symbol is there already.  This takes care of the first requirement.  Each record in the table can then be given an additional field to store what kind of object a symbol is: an individual, a type, a predicate or a bound variable.  A parameter to the entering procedure handles assignments to this field, and after lookup the field can be inspected.  This takes care of the second requirement.
</p>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <i>Step 3:</i></h3>
<div class="outline-text-3" id="text-5-5">
<p>
Further refinements are needed to check whether actual parameters of predicates match the formal parameters in number and in type.  A similar problem arises in conventional programming languages such as Pascal.  In these languages the formal parameters of procedures and functions have names, and these names are handled rather like the names of local variables: they are entered into the symbol table together with their type.  Then, inside the body, the names of the formal parameters are visible, but outside the body, for a call, only their number and type is known, and the table is consulted to check agreement in number and type between the actual and the formal parameters.  This method could also be used here, even though the formal parameters do not have names.  However, one should be reluctant to clutter up the table for nameless entities.  So it is probably best to introduce a separate table for parameters.  For each predicate the entry in the symbol table contains a link to a sequence of formal parameter types in the parameter table.  In that table the records contain, for each parameter, the type of the parameter and a boolean flag which for all but the last parameter is set to false.  Thus when a sequence of actual parameters is to be checked for conformity with the formal parameter types, a simple stepping process can compare the actuals with the formals.
</p>

<p>
The <i>types</i> are just set unions of sorts.  For every sort that is declared by enumeration, a counter of sorts is incremented, and the sort being declared has that new integer assigned to it.  For every sort that is declared as a union, the union is computed from the constituent types.
</p>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Semantics &#x2014; closed atomic formulas</h3>
<div class="outline-text-3" id="text-5-6">
<p>
The program essentially determines whether formulas are true or false in an interpretation.  To do so, it has to determine whether atomic formulas are true in the interpretation.  Hence, at the very least, an interpretation is a function which for each closed atomic formula, such as <code>p(a,b,c)</code>, returns one of the two truth values, or perhaps neither.
</p>
</div>

<div id="outline-container-sec-5-6-1" class="outline-4">
<h4 id="sec-5-6-1"><span class="section-number-4">5.6.1</span> <i>Predicates as truth functions</i>:</h4>
<div class="outline-text-4" id="text-5-6-1">
<p>
As a first step, we may think of the interpretation as consisting of several functions, one for each predicate.  For an n-ary predicate there would be an n-ary function.  Thus to compute the truth value of the atomic formula <code>p(a,b,c)</code> we have to compute the value of the function associated with the predicate <code>p</code> for the actual parameters <code>(a,b,c)</code>.
</p>

<p>
Next, we consider how these functions are to be implemented.  The number of possible parameters is finite, in fact quite small, in particular because of the system of sorts.  So the most natural way to implement the function needed for an n-ary predicate is as an n-dimensional array.  Thus for <code>p(a,b,c)</code> we need to look up a three dimensional array of truth values and perhaps the undefined value.  The required value is to be found in this array at a position which depends on the types of the formal parameters, and on the position, within those types, of the actual parameters <code>a,b,c</code>.  It is important to note that for a different predicate, say <code>q</code>, which also takes three parameters and for which the parameters <code>(a,b,c)</code> are also legal, the position of <code>q(a,b,c)</code> might be quite different from what it is for <code>p(a,b,c)</code>.  This will happen if one or more of the parameters of the one predicate is a union but for the other predicate it is a different union or a basic sort.
</p>

<p>
In general, each formal parameter to a predicate will be the union of basic sorts.  Hence the size of the dimension corresponding to a formal parameter will be the sum of the sizes of the basic sorts in that union.  To find the address of an actual parameter, we have to take its ordinal value within the basic sort in which it was declared.  But in general its basic sort will not be the first in that union, so the ordinal value will have to added to the sum of the sizes of the preceding sorts in the union:
</p>

<pre class="example">
address of current actual parameter  =
    sum of sizes of preceding sorts in the union
  + ordinal value of current actual parameter in its sort
</pre>

<p>
The sum of sizes of preceding sorts can be computed once and for all when the predicate is being declared.  Since the sum needed depends on the sort of the actual parameter, separate sums are needed for each sort in the union.  It is best to have another table which is entered from the parameter table.  For each of the basic sorts in the union of sorts for a formal parameter this table contains the sum of the sizes of the preceding sorts.  For a declaration of a predicate with three formal parameters these table entries have to be done three times.  Then, for an atomic formula such as <code>p(a,b,c)</code>, a triple of addresses has to be computed, each using the above formula.
</p>
</div>
</div>
