text/19-db-query-lang.org
*** /Linearising the array/:
The addresses are for an imaginary array which has as many dimensions as the predicate takes parameters.  In practice, of course, the array cannot be implemented like this, because the dimensions needed will vary for different runs of the program.  Instead the implementation will have to do what is a routine technique in the implementation of standard programming languages: all arrays of whatever dimensions are taken as consecutive portions in one single long array, the computer memory.  To do this, the addresses computed in the preceding paragraphs have to be adjusted so that they become addresses in a linear array.

For the time being we shall assume that the n-dimensional array for the n-ary predicate is to be implemented as a separate one-dimensional array starting at virtual address zero.  We must now translate each n-tuple of addresses in the n-dimensional array into a single address in the one-dimensional array.  The total size of the one-dimensional array is the n-fold product of the sizes of the dimensions of the n-dimensional array.  For example, for n = 2 for a predicate =p(x,y)= in which =x= can take 4 values and =y= can take 5, the 2-dimensional array is 4 * 5, and it has to be mapped onto an array of size 20.  To map a pair, say =<2,3>=, of addresses, we add the address for the first ordinate, 2, to the address of the second ordinate, 3, multiplied by the size of the preceding ordinate, the first ordinate, which is 4.  This gives as the address 2 + (4 * 3) = 14.  It might help to look at the entire mapping: The row headings are for the x-ordinate, the column headings are for the y-ordinate.  The matrix entries are the addresses in the linearised array.

#+begin_example
                y

                0   1   2   3   4
              +------------------
        x  0  | 0   4   8  12  16
           1  | 1   5   9  13  17
           2  | 2   6  10  14  18
           3  | 3   7  11  15  19
#+end_example

If there were a further dimension, =z=, then addresses in this dimension would have to be multiplied by the product of the sizes of the preceding dimensions, which is 20.  To generalise, an n-tuple of addresses is translated into the sum of the addresses of the ordinates, each multiplied by the product of the sizes of the preceding dimensions.  We can now adjust the addresses for actual parameters given earlier: the contribution of an actual parameter to the final sum is given by

#+begin_example
    address contribution of current actual parameter  =
        product of sizes of preceding parameters
        *  (  sum of sizes of preceding sorts in the union
            + ordinal value of current actual parameter in its sort)
#+end_example

The product of the sizes of the preceding parameters can be computed once and for all when the predicate is being declared.  So, for each parameter the sizes are multiplied to form a cumulative product.  Then, for formal parameters the product of the sizes of the preceding parameters can be entered into the table of parameters.

*** /A single array for all predicates/:
The address contributions of all actual parameters eventually have to be added to yield the address in the linear array corresponding to the predicate.  In practice it is not possible to have a separate linear array for each predicate, because the sizes of these arrays will vary from run to run.  Instead the implementation will again have to do what is standard in the implementation of programming languages: all these linear arrays are taken from one single array.  So the sum of the address contributions mentioned earlier will have to be given a further offset which is the beginning of the space for the predicate.  Hence the actual address in the single array is given by:

#+begin_example
    actual address =
        sum of sizes of preceding predicates
        + SUM, for all actual parameters i,
            of address contribution of actual parameter i
#+end_example

Retracing these steps backwards, we see that the following has to be done for predicate declarations: 1: A cumulative sum, starting at 0, of sizes of predicates has to be kept.  When a predicate is being declared, the previous value of that sum has to be entered into the symbol table as the start address of that predicate.  The sum is updated when the predicate has been fully declared, to be used as the start address of the next predicate, if any.  The sum has to be a global variable to survive different groups of top-level commands.  2: For each predicate a cumulative product, starting at 1, of sizes of parameters has to be kept.  When a parameter is being declared, the previous value of that product has to be entered into the parameter table as the multiplier for the current parameter.  The product is updated when the parameter has been fully declared, to be used as the multiplier for the next parameter, if any.  The product can be a variable local to =top_level=.  3: For each parameter of a predicate a cumulative sum, starting at 0, of sizes of sorts has to be kept.  When the type of the parameter is being analysed into its constituent sorts, for each sort the previous value of that sum has to be entered into the parameter type table as the sum of sizes of preceding sorts.  The sum is updated when the sort has been analysed, to be used for the next sort in the union, if any.  The sum can be a variable local to =top_level=.

Note that the three accumulating variables just described are being used for making entries in the three tables: the symbol table, the parameter table for predicates, and the sort table for parameters.  The entries in the tables are needed for code generation.

The entries in the three tables are used for computing the addresses required for atomic formulas such as =p(a,b,c)=.  The calculation of an address can be done while the atomic formula is being read, and it results in a single code node being generated.  In this way the interpreter does not have to recalculate the required address each time it needs to evaluate the formula.  The calculation of the address takes place in several steps: one for the predicate =p=, and one for each of the parameters =(a,b,c)=.  The first step, when reading the predicate =p=, looks up the symbol table for the start address of the predicate and generates a code node with that start address.  The additional steps, one for each of the parameters, perform a fixup on the code node, by adding the address contributions of each actual parameter.

