text/19-db-query-lang.org
*** /Extensions/:
The method described is used for generating code for atomic formulas to be used by the interpreter for looking up the memory array to determine the truth value of such atomic formulas.  Essentially the same method can be used for assigning literal =EXTENSION=s to predicates, i.e. of the form =p = {<a b c> <d e f>..}=, for setting the memory array in the first place.  For both tasks a tuple of actual parameters has to be processed; for atomic formulas the tuple is of the form =(a,b,c)=, for extensions it is of the form =<a,b,c>=.  The two different brackets are handled by different procedures: =(= and =)= are handled by procedure =factor=, ={= and =}= are handled by procedure =top_level=.  at different places.  But the treatment of the parameters can be made identical inside procedure =tuple=.  For atomic formulas =p(a,b,c)= this results in a fixup of the node generated when the predicate =p= was being read.  But for =EXTENSION=s the code node has to be generated for each triple =<a,b,c>= in the extension of the predicate.  Each such node will be fixed up in a way that is specific to the triple, but the node has to be generated in the first place.

The other, non-literal method of assigning extensions, i.e. those of the form =p = {THE <x:t, y:u, ..> expression}=, is described at the end of the next section.

** Semantics --- variables

*** /Requirements/:
In this section we consider formulas containing variables introduced by either quantifiers or by =WHICH= declarations.  For finite interpretations, but only for finite interpretations, a universally quantified formula is logically equivalent to a conjunction, an existentially quantified formula is logically equivalent to a disjunction.

The conjuncts or disjuncts have to be substitution instances of the given formula in which all occurrences of the variable that are bound by the quantifier are replaced by a reference to an individual in the domain.

In the case of a sorted system the substitutions have to range over all individuals having the type of the quantification.  Much the same holds for variables bound by =WHICH= declarations: substitutions have to be made using al individuals having the type in the declarations.  Then, for each substitution, the remainder of the formula has to be evaluated.  If it is true, then the variable and its current substitution have to be printed.

There are many ways in which variables and their binding can be implemented.  One naive implementation would use literal substitutions to generate long conjunctions and disjunctions for quantified formulas and use a similar expansion for =WHICH= and =FIRST= queries.  Essentially this would treat quantification as a macro mechanism: from the compiled internal code it would not be possible to tell whether the user wrote a quantified formula or a long conjunction or disjunction.  A similar treatment would be given to =WHICH= and =FIRST= queries.  The big disadvantage of this implementation method is the large amount of internal code that has to be generated.

Another method would be this: instead of performing the substitutions at compile time, they could be postponed till run time.  The interpreter would then create each of the disjuncts and conjuncts on the fly, possibly by modifying the code.

