19-db-query-lang.html
<div id="outline-container-sec-5-6-4" class="outline-4">
<h4 id="sec-5-6-4"><span class="section-number-4">5.6.4</span> <i>Extensions</i>:</h4>
<div class="outline-text-4" id="text-5-6-4">
<p>
The method described is used for generating code for atomic formulas to be used by the interpreter for looking up the memory array to determine the truth value of such atomic formulas.  Essentially the same method can be used for assigning literal <code>EXTENSION=s to predicates, i.e. of the form =p = {&lt;a b c&gt; &lt;d e f&gt;..}</code>, for setting the memory array in the first place.  For both tasks a tuple of actual parameters has to be processed; for atomic formulas the tuple is of the form <code>(a,b,c)</code>, for extensions it is of the form <code>&lt;a,b,c&gt;</code>.  The two different brackets are handled by different procedures: <code>(</code> and <code>)</code> are handled by procedure <code>factor</code>, <code>{</code> and <code>}</code> are handled by procedure <code>top_level</code>.  at different places.  But the treatment of the parameters can be made identical inside procedure <code>tuple</code>.  For atomic formulas <code>p(a,b,c)</code> this results in a fixup of the node generated when the predicate <code>p</code> was being read.  But for <code>EXTENSION=s the code node has to be generated for each triple =&lt;a,b,c&gt;</code> in the extension of the predicate.  Each such node will be fixed up in a way that is specific to the triple, but the node has to be generated in the first place.
</p>

<p>
The other, non-literal method of assigning extensions, i.e. those of the form <code>p = {THE &lt;x:t, y:u, ..&gt; expression}</code>, is described at the end of the next section.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> Semantics &#x2014; variables</h3>
<div class="outline-text-3" id="text-5-7">
</div><div id="outline-container-sec-5-7-1" class="outline-4">
<h4 id="sec-5-7-1"><span class="section-number-4">5.7.1</span> <i>Requirements</i>:</h4>
<div class="outline-text-4" id="text-5-7-1">
<p>
In this section we consider formulas containing variables introduced by either quantifiers or by <code>WHICH</code> declarations.  For finite interpretations, but only for finite interpretations, a universally quantified formula is logically equivalent to a conjunction, an existentially quantified formula is logically equivalent to a disjunction.
</p>

<p>
The conjuncts or disjuncts have to be substitution instances of the given formula in which all occurrences of the variable that are bound by the quantifier are replaced by a reference to an individual in the domain.
</p>

<p>
In the case of a sorted system the substitutions have to range over all individuals having the type of the quantification.  Much the same holds for variables bound by <code>WHICH</code> declarations: substitutions have to be made using al individuals having the type in the declarations.  Then, for each substitution, the remainder of the formula has to be evaluated.  If it is true, then the variable and its current substitution have to be printed.
</p>

<p>
There are many ways in which variables and their binding can be implemented.  One naive implementation would use literal substitutions to generate long conjunctions and disjunctions for quantified formulas and use a similar expansion for <code>WHICH</code> and <code>FIRST</code> queries.  Essentially this would treat quantification as a macro mechanism: from the compiled internal code it would not be possible to tell whether the user wrote a quantified formula or a long conjunction or disjunction.  A similar treatment would be given to <code>WHICH</code> and <code>FIRST</code> queries.  The big disadvantage of this implementation method is the large amount of internal code that has to be generated.
</p>

<p>
Another method would be this: instead of performing the substitutions at compile time, they could be postponed till run time.  The interpreter would then create each of the disjuncts and conjuncts on the fly, possibly by modifying the code.
</p>
</div>
</div>
