text/19-db-query-lang.org
*** /Implementing substitution/:
But there is another way again, by using a mechanism which does not perform any literal substitution but something equivalent.  Again some code would be generated for the formula and some additional code for the binding.  This latter code is then used by the interpreter to perform actions equivalent to the substitution.  It may help to think of an analogy in procedural programming.  There a =FOR= loop generates code for the loop body and some additional code for sequencing the =FOR= variable through its values.  During each execution of the loop body any reference to the =FOR= variable looks up its current value.  A similar method can be used to implement quantifier binding and query binding.  The formula corresponds to the loop body, and the additional code for the binding corresponds to the sequencing code of the =FOR= variable.  In both cases the additional code has to do much the same: A =FOR= variable has to be stepped from its low value to its high value, or vice versa for the =DOWNTO= version.  A quantified variable or a query variable also has to be stepped through all its values, although there is no particular order required.  During each execution of the code for the formula, any reference to the bound variable looks up its current value.  For an unsorted system the stepping has to go through the entire domain.  For a sorted system the code has to be executed only for those individuals whose sort is included in the binding.

The simplest way of implementing this is to generate the additional code for the binding in a form which contains the set of those sorts that are included in the binding.  The interpreter then steps through all the individuals in the interpretation and if its sort is a member of the sort included in the binding, then it proceeds to execute the code for the formula.  The disadvantage of this implementation method is that it fails to make use of one of the promised efficiency advantages of the sorted system.  By stepping through all individuals in the interpretation and checking their sort, the sorted interpreter does much the same as what an unsorted interpreter would do by testing an additional formula.  For example, the sorted formula =SOME x:t f(x)= would be processed in much the same way as the unsorted formula =SOME x (t(x) AND f(x))= would be processed: stepping through all individuals and testing whether =t(x)= holds before going on to =f(x)=.  In short, the expected gain in execution speed is largely lost.  It is not lost entirely, because checking that a particular individual is of a particular sort will still be faster than checking whether the formula =t(x)= is true, especially if type =t= is really a union of sorts =s1, s2, ..sN=, and what has to be checked is a disjunction =s1(x) OR s2(x) OR .. sN(x)=.

There is a simple remedy to this.  Instead of stepping through all the individuals in the interpretation, the interpreter can first step through all the sorts.  If a particular sort is a member of the set of sorts included in the binding, then the interpreter steps through the individuals of that sort and for each of them executes the code for the formula.  Since the number of sorts is substantially smaller than the number of individuals, the stepping through all sorts and ignoring those that are not required constitutes only a minimal overhead for the interpreter.

It might be thought that it is possible to improve this even further.  The sorts that have to be stepped through are known at compile time, so the stepping could be done then.  The compiler would then have to generate appropriate code for each sort that is included in the binding.  This would save the interpreter from having to do the stepping, and if the interpreter had to do the entire stepping repeatedly, some saving would result.  However, nothing would be saved in the case of =WHICH= bindings since they are always outermost and only interpreted once.  For database queries even quantifier bindings tend not to be embedded deeply in truthfunctionally compound formulas.  Since the overhead of stepping through unnecessary sorts repeatedly is likely to be small, this optimisation will not be considered any further.

*** /Verifying existentials/:
The above design has the following implications for the interpreter: For =WHICH= and =FIRST= queries, and for making existentially quantified formulas true and making universally quantified formulas false, the interpreter enters a double =FOR= loop.  The outer loop steps through all the sorts that have been declared.  One of the fields of the instruction contains a pointer to the symbol table for the bound variable.  The interpreter can now inspect the set of sorts for that variable.  If the sort of the outer =FOR= loop is in this set, then the interpreter enters its inner =FOR= loop, with the bounds obtained from the table of sorts for the current sort.  The inner =FOR= loop now steps through all the individuals in that sort.  Information about the current individual has to be put somewhere to be picked up later when the individual variable is being referenced.  Since bindings can be nested, the place to put this information is a run time stack.  The information that is needed is in part the same as what was computed at compile time for atomic formulas with constants (see preceding section): The sum of sizes of preceding sorts in the union of sorts being bound, plus the ordinal value of the current individual in its own sort.  A very simple mechanism achieves this: a field of the top of the stack is initialised to 0 and incremented at the end of the inner =FOR= loop.  It is useful, mainly for tracing purposes, to give the stack elements two other fields, one to record the name of the variable being bound, another to record the name of the individual that has been made the value of the variable.  Instead of actual names, it is better to record indices into the symbol table.  The main business of the inner =FOR= loop is to call the interpreter recursively using the remainder of the formulas a parameter.  If that call produced at least one success, it is desirable to jump out of the two loops except for =WHICH= queries.

