19-db-query-lang.html
<div id="outline-container-sec-5-7-4" class="outline-4">
<h4 id="sec-5-7-4"><span class="section-number-4">5.7.4</span> <i>Verifying universals</i>:</h4>
<div class="outline-text-4" id="text-5-7-4">
<p>
For making universally quantified formulas true and for making existentially quantified formulas false, one cannot use the double <code>FOR</code> loop method.  Instead a method has to be used which we have already encountered in Chapter 15 for the monadic logic theorem prover.  There we used continuations to obtain the effect of stepping through all the individuals in the domain.  The situation is more complicated because we have to simulate two nested <code>FOR</code> loops: an outer one to step through all the sorts, and, for those sorts that are included in the binding, an inner loop to step through all the individuals in that sort.  Again it is not possible to use real loops, because simulating the conjunction requires implementation by continuations.
</p>

<p>
When the interpreter sees a universally quantified formula to be made true (or an existentially quantified formula to be made false), then it has to set up what in effect is the outer loop for stepping through the sorts, and then call a parameterless procedure for finding the next sort, initially the first sort.  That procedure will be called repeatedly, but some later calls are indirect, as continuations.  The body of that procedure has to check whether all sorts have been stepped through, and in that case it can pop the stack and call the continuation procedure to the interpreter.  Otherwise it conducts a (sentinel) search through the sorts to find the next sort included in the binding.  If there are no further sorts to be found, then it can pop the stack and call the continuation.  But if there is a further sort, then it can set up the simulation of the inner loop and call a procedure for stepping through the individuals of that sort.  That procedure takes a continuation procedure, and for this initial call the actual continuation has to be the procedure for stepping through the sorts, itself.  The body of that procedure has to check whether there is another individual in the current sort.  If not, it directly calls the procedure for taking the next sort.  Otherwise it sets up the binding of the variable on the top of the stack to the current individual, and then calls the interpreter recursively.  For this call it uses the remainder of the formula as the one parameter.  The other parameter has to be a parameterless continuation.  Ideally it should be the procedure to take the next individual, but since that procedure takes a continuation this method is not possible.  Instead the other actual parameter can be made a local parameterless procedure which when called will call the procedure to take the next individual.
</p>
</div>
</div>
<div id="outline-container-sec-5-7-5" class="outline-4">
<h4 id="sec-5-7-5"><span class="section-number-4">5.7.5</span> <i>Atoms with variables</i>:</h4>
<div class="outline-text-4" id="text-5-7-5">
<p>
For atomic formulas such as <code>p(a,x,c)</code>, the address contributions of the predicate <code>p</code> and the two constants <code>a</code> and <code>c</code> have been computed at compile time and form part of the instruction for the predicate.  But the contribution of the variable <code>x</code> can only be known at run time, when (nominally) a constant, say <code>b</code>, has been substituted.  However the contribution of that constant also depends on the fact that in this atomic formula it is the second parameter, and hence the address contribution has to be multiplied by the product of the sizes of preceding parameters.  This product is known at compile time, and it has to be made one part of the instruction.  The other part is the location in the stack, which also has to be known at compile time, and where the additive part for the current constant is to be found.  Since an atomic formula can contain any number of occurrences of variables, it is not possible to fit the code for an atomic formula into a fixed length instruction.  Instead it is necessary to generate an additional instruction for each actual parameter that is a bound variable.
</p>

<p>
So, when the interpreter sees an instruction for a predicate, it places the compile time address contribution into a global accumulator.  Then, for each following instruction for a variable it multiplies the product part of the instruction with the contents of the stack at the address part of the instruction and adds this to the accumulator.  At this point the accumulator contains the required address in memory.  If the memory at that address contains the required value, then the continuation procedure is called.
</p>
</div>
</div>
<div id="outline-container-sec-5-7-6" class="outline-4">
<h4 id="sec-5-7-6"><span class="section-number-4">5.7.6</span> <i><code>THE</code> declarations</i>:</h4>
<div class="outline-text-4" id="text-5-7-6">
<p>
In declarations of extensions of predicates, when the extension is given by a <code>THE</code>-formula, the binding is treated like an existential.  The interpreter is then run to find those tuples which make the following expression true.  But instead of showing the tuples, the interpreter has to set the extension of the predicate.
</p>


</div>
</div>
</div>

<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> Semantics &#x2014; other aspects</h3>
<div class="outline-text-3" id="text-5-8">
</div><div id="outline-container-sec-5-8-1" class="outline-4">
<h4 id="sec-5-8-1"><span class="section-number-4">5.8.1</span> <i>Logical operations</i>:</h4>
<div class="outline-text-4" id="text-5-8-1">
<p>
For the two constants <code>TRUE</code> and <code>FALSE</code> and for the unary operator <code>NOT</code> both the code generation and its interpretation are entirely obvious.  For the binary operators the code generation is also quite straightforward.  However, their interpretation requires a small elaboration that we have not yet encountered in previous programs.  To prevent unnecessary branching when making disjunctions true, it is desirable to prevent the execution of the second disjunct if there are no <code>WHICH</code> variables and the execution of the first disjunct produced at least one solution.
</p>
</div>
</div>
<div id="outline-container-sec-5-8-2" class="outline-4">
<h4 id="sec-5-8-2"><span class="section-number-4">5.8.2</span> <i>Sorts Used As Predicates</i>:</h4>
<div class="outline-text-4" id="text-5-8-2">
<p>
Atomic formulas can be of the form <code>s(i)</code>, where <code>s</code> is a sort and <code>i</code> is either a constant &#x2014; perhaps not very common &#x2014; or a variable.  If <code>i</code> is a constant, then the code to be generated has to be a <code>TRUE</code> or <code>FALSE</code> node, depending whether <code>i</code> is in the sort <code>s</code>.  If <code>i</code> is a variable, then a special node can be generated: Its left field is the stackaddress of the variable, its right field is a pointer to the sort in the symbol table.  When this node is interpreted later, it will succeed just in case the current sort of the stack variable is a subsort of the sort indicated by the right field.
</p>
</div>
</div>
