text/19-db-query-lang.org
*** /Identity Statements/:
These are of the form =i = j=, where =i= and =j= are either constants or variables.  In the uninteresting case where both are constants, the code that has to be generated is a =TRUE= or =FALSE= node depending on whether they are the same constant.  If one is a constant and the other is a variable, then a special node can be generated: Its left field is the stack address of the variable, its right field is the pointer to the constant in the symbol table.  When the code is interpreted, it will succeed just in case the current value of the stack variable is identical with the constant.  If both parts of the identity statement are variables, then another kind of node has to be generated in which both the left and the right field are stack addresses.  At run time such a node succeeds just in case the current values of the two variables are identical.

The internal code used is mainly binary tree code, generated by calls to a code generating procedure.  The code for the truth functional connectives is entirely familiar.  The code for the quantifiers =ALL= and =SOME= and for the query binders =WHICH= and =FIRST= is like that for the unary operator =NOT=, except that information about the variable being bound has to be stored somewhere, such as the vacant left field of the code nodes.  The really difficult part of the code generation concerns the calculation of addresses into memory, as described in the previous section.

