19-db-query-lang.html
<div id="outline-container-sec-5-8-3" class="outline-4">
<h4 id="sec-5-8-3"><span class="section-number-4">5.8.3</span> <i>Identity Statements</i>:</h4>
<div class="outline-text-4" id="text-5-8-3">
<p>
These are of the form <code>i = j</code>, where <code>i</code> and <code>j</code> are either constants or variables.  In the uninteresting case where both are constants, the code that has to be generated is a <code>TRUE</code> or <code>FALSE</code> node depending on whether they are the same constant.  If one is a constant and the other is a variable, then a special node can be generated: Its left field is the stack address of the variable, its right field is the pointer to the constant in the symbol table.  When the code is interpreted, it will succeed just in case the current value of the stack variable is identical with the constant.  If both parts of the identity statement are variables, then another kind of node has to be generated in which both the left and the right field are stack addresses.  At run time such a node succeeds just in case the current values of the two variables are identical.
</p>

<p>
The internal code used is mainly binary tree code, generated by calls to a code generating procedure.  The code for the truth functional connectives is entirely familiar.  The code for the quantifiers <code>ALL</code> and <code>SOME</code> and for the query binders <code>WHICH</code> and <code>FIRST</code> is like that for the unary operator <code>NOT</code>, except that information about the variable being bound has to be stored somewhere, such as the vacant left field of the code nodes.  The really difficult part of the code generation concerns the calculation of addresses into memory, as described in the previous section.
</p>
</div>
</div>
</div>
</div>
