text/19-db-query-lang.org
* The program

The following is the Pascal source file.  It is not quite standard, because it uses the utilities of the previous chapter in an =INCLUDE= file.  If your Pascal does not allow included files, you will have to physically include that file at the point where the =INCLUDE= directive occurs, about half a page down.  If your Pascal insists that declarations of labels, types, variables and procedures and functions occur strictly in this order --- then the various declarations will have to be merged.

From the utilities of Chapter~17 procedure =check= is used extensively to produce an error message in case a required symbol is not seen.  Importantly, the procedure will then accept some reasonable approximation to the required symbol --- a likely typing error --- to keep the parser in step with the input.  Note that for small values (1..3) of the utility variable =writelisting= additional information is written to both the output file and the listing file.  For larger values (10..15) voluminous but sometimes indispensible tracing information will be written to the listing file only.

#+begin_src pascal
PROGRAM datbas(input,output);

LABEL 10,90,99;

CONST
    errormark = '%DB';
    list_filename = '43datbas.lst';
    reslength = 12; emptyres = '            ';
    maxrestab = 35;
    identlength = 32;
    emptyident = '                                ';
    maxstdidenttab = 1; (* dummy *)

TYPE
    symbol =
        (undefined,show_,quit_,predicate_,determinable_,determinate_,
        sort_,individual_,extension_,the_,
        all_,all_det,some_,some_det,which_,which_det,first_,first_det,
        and_,iff_,imp_,not_,or_,true_,false_,equal,equalc,
        leftbrace,rightbrace,rightparenthesis,
        comma,period,colon,semic,leftangle,rightangle,altern_,
        (* compulsory for scanutilities: *)
        charconst,stringconst,numberconst,
        leftparenthesis,hyphen,identifier);
    standardident = (dummy);

%INCLUDE '41SCANUT.PAS'

PROCEDURE initialise;
VAR i : integer;
BEGIN (* initialise *)
iniscanner;
specials_repeat := ['='];
erw( '(           ' ,leftparenthesis); (* not used *)
erw( ')           ' ,rightparenthesis);
erw( ',           ' ,comma);
erw( '.           ' ,period);
erw( ':           ' ,colon);
erw( ';           ' ,semic);
erw( '<           ' ,leftangle);
erw( '=           ' ,equal);
erw( '>           ' ,rightangle);
erw( 'ALL         ' ,all_);
erw( 'AND         ' ,and_);
erw( 'DETERMINABLE' ,determinable_);
erw( 'DETERMINATE ' ,determinate_);
erw( 'EXTENSION   ' ,extension_);
erw( 'FALSE       ' ,false_);
erw( 'FIRST       ' ,first_);
erw( 'IFF         ' ,iff_);
erw( 'IMP         ' ,imp_);
erw( 'INDIVIDUAL  ' ,individual_);
erw( 'NOT         ' ,not_);
erw( 'OR          ' ,or_);
erw( 'PREDICATE   ' ,predicate_);
erw( 'QUIT        ' ,quit_);
erw( 'SHOW        ' ,show_);
erw( 'SOME        ' ,some_);
erw( 'SORT        ' ,sort_);
erw( 'THE         ' ,the_);
erw( 'TRUE        ', true_);
erw( 'WHICH       ' ,which_);
erw( '{           ' ,leftbrace);
erw( '|           ' ,altern_);
erw( '}           ' ,rightbrace);
END; (* initialise *)

CONST
    prime_number = 47;  (* e.g. 997 *)
    maxtable = 300;
    maxparamtable = 500;
    maxsorts = 31;
    maxpartyptable = 1000;
    maxcode = 100;
    maxmemory = 1000;
    maxbindingstack = 10;
    maxval = 225;
TYPE
    sortrange = 0 .. maxsorts;
    sortset = SET OF sortrange;
    tablerange = 0..maxtable;
    hashrange = 0..prime_number;
    paramrange = 0..maxparamtable;
    partyprange = 1..maxpartyptable;
    memrange = 0..maxmemory;
    coderange = 0..maxcode;
    stackrange = 0..maxbindingstack;
    valrange = 0..maxval;
VAR
    facbegsys,querybegsys,top_levelbegsys,typebegsys : symset;
    table : ARRAY [tablerange] OF RECORD
                alf : identalfa; next : tablerange;
                CASE ob : symbol OF
                    sort_ :
                        (s_sort : sortset;
                         s_sortaddress : sortrange;
                         s_size : tablerange);
                    individual_ :
                        (i_sortaddress : sortrange;
                         i_ord : tablerange);
                    predicate_,determinable_,determinate_,
                    all_det,some_det,which_det,first_det :
                        (p_params : partyprange;
                         p_mem : memrange;
                         p_val : valrange;
                         p_info : memrange (* only for trace *) );
                    all_,some_,which_,first_,the_ :
                        (b_sort : sortset;
                         b_stackaddress : stackrange);
                    END; (* CASE, RECORD *)
    lasttable,locatn,sentinel : tablerange;
    hashtable : ARRAY [hashrange] OF tablerange;
    h : hashrange;
    sorttable : ARRAY [sortrange] OF
        RECORD tabl_ptr : tablerange; sort_size : tablerange END;
    lastsort : sortrange;

    paramtable : ARRAY [paramrange] OF RECORD
        ad : integer;
        sorts : sortset;
        firstsort : partyprange;
        paramsize : integer;
        mult : integer;
        islast : boolean
        END;
    lastparamtable : paramrange;
    partyptable : ARRAY [partyprange] OF
        RECORD tblptr : tablerange; add : integer END;
    lastpartyptable : partyprange;

    code : ARRAY [coderange] OF
        RECORD
            op : symbol;
            left:tablerange; right : memrange;
            val : valrange
            END;
    cx : coderange;
    memory : ARRAY [memrange] OF valrange;
    mx : memrange;

    bindingstack : ARRAY [stackrange] OF
        RECORD add,adr,var_ptr : tablerange END;
    top,indvars,detvars : stackrange;
    actualaddress : memrange;
    num_successes : integer;
    clock_start : integer;
    calls_to_make : integer;

PROCEDURE writeset(s : sortset);
VAR i : integer;
BEGIN
putch('[');
FOR i := 0 TO maxsorts DO
    IF i IN s THEN BEGIN putch(' '); writeinteger(i) END;
putch(']')
END; (* writeset *)

(* - - - - -   I N T E R P R E T E R   - - - - - *)

PROCEDURE listcode(i : coderange);
BEGIN
WITH code[i] DO
    BEGIN
    write(listing,i:4,'    ',op,left:4,right:4,'    ');
    IF op IN [predicate_,determinable_,determinate_,
              all_,some_,which_,first_,the_] THEN
        BEGIN
        write(listing,table[left].alf,' (',val:0,')');
        IF op = determinate_ THEN write(listing,'(',val:0,')')
        END;
    writeln(listing)
    END
END; (* listcode *)

PROCEDURE show;
VAR i,j : integer;
BEGIN (* show *)
num_successes := num_successes + 1;
writeinteger(num_successes); putch(':'); writeline;
FOR i := 1 TO indvars + detvars DO
    WITH bindingstack[i] DO
        BEGIN
        FOR j := 1 TO 4 DO putch(' ');
        writeident(table[var_ptr].alf);
        putch(' '); putch('='); putch(' ');
        writeident(table[adr].alf); writeline
        END;
END; (* show *)

PROCEDURE make(g : boolean; f : coderange; PROCEDURE cp);
LABEL 5,6;
VAR i,j,k : integer;

    PROCEDURE trueright;
    BEGIN make(true,code[f].right,cp) END;

    PROCEDURE falseright;
    BEGIN make(false,code[f].right,cp) END;

    PROCEDURE sameright;
    BEGIN make(g,code[f].right,cp) END;

    PROCEDURE popstack;
    BEGIN top := k - 1; cp END;

    PROCEDURE nexttype;
    VAR s : sortset;

        PROCEDURE nextinstance(PROCEDURE cp);

            PROCEDURE furtherinstance;
            BEGIN nextinstance(cp) END;

        BEGIN (* nextinstance *)
        j := j + 1;
        WITH sorttable[i] DO
            IF j > tabl_ptr + sort_size THEN nexttype ELSE
                BEGIN
                IF writelisting > 12 THEN
                    BEGIN
                    write(listing,'instance = ',table[j].alf,' in ');
                    listcode(f)
                    END;
                WITH bindingstack[k] DO
                    BEGIN adr := j; add := add + 1 END;
                IF writelisting > 10  THEN
                    writeln(listing,'universal instance, add = ',
                        bindingstack[k].add:0);
                make(g,code[f].right,furtherinstance)
                END
        END; (* nextinstance *)

    BEGIN (* nexttype *)
    IF i > lastsort THEN popstack ELSE
        BEGIN
        s := table[code[f].left].b_sort
             + [lastsort + 1]; (* sentinel *)
        REPEAT i := i + 1 UNTIL i IN s;
        IF i > lastsort THEN popstack ELSE
            BEGIN
            j := sorttable[i].tabl_ptr;
            nextinstance(nexttype)
            END
        END
    END; (* nexttype *)

    PROCEDURE nextdeterminate;
    BEGIN (* nextdeterminate *)
    WITH bindingstack[k] DO
        BEGIN
        add := add + 1;
        IF writelisting > 13 THEN
            writeln(listing,'add = ',add:0);
        IF add > j THEN popstack ELSE
            make(g,code[f].right,nextdeterminate)
        END
    END; (* nextdeterminate *)

BEGIN (* make *)
calls_to_make := calls_to_make + 1;
IF writelisting > 10 THEN
    BEGIN write(listing,g:1); listcode(f) END;
WITH code[f] DO
    CASE op OF
        predicate_,determinate_,determinable_ :
            BEGIN
            actualaddress := right;
            (* NOTE that the following requires the LAST code
               to be a dummy to stop previous query interfering *)
            i := f + 1;
            WHILE code[i].op = individual_ DO
                BEGIN
                IF writelisting > 10 THEN
                    BEGIN
                    write(listing,g:1,'  ');
                    listcode(i)
                    END;
                WITH code[i] DO
                    BEGIN
                    actualaddress :=
                        actualaddress +
                            left * bindingstack[right].add;
                    IF writelisting > 13 THEN
                        WITH bindingstack[right] DO
                          writeln(listing,table[var_ptr].alf,
                            ' := ',table[adr].alf)
                    END;
(* here would be a correction for sorts in parameter that
  are not sorts in the binding; add (size * multiplier *)
                i := i + 1
                END;
            IF op = determinable_
                THEN i := bindingstack[val].add
                ELSE i := val;
            IF (memory[actualaddress] = i) = g THEN
                BEGIN
                IF writelisting > 10 THEN writeln(listing,'SUCCESS');
                cp
                END
              ELSE
                IF writelisting > 10 THEN writeln(listing,'FAIL')
            END;
        all_,some_,which_,first_,the_ :
            BEGIN
            top := top + 1;
            IF op IN [which_,first_ ]
                THEN indvars := indvars + 1;
            WITH bindingstack[top] DO
                BEGIN
                var_ptr := left; add := 0;
                IF (op IN [some_,which_,first_,the_ ]) = g THEN
                    BEGIN
                    FOR i := 1 TO lastsort DO
                        IF i IN table[left].b_sort THEN
                            WITH sorttable[i] DO
                                BEGIN
                                IF writelisting > 11 THEN
                                  BEGIN
                                  write(listing,
                                    'sort is: ',table[tabl_ptr].alf);
                                  listcode(f)
                                  END;
                                FOR j := tabl_ptr + 1 TO
                                    tabl_ptr + sort_size  DO
                                  BEGIN
                                  adr := j;
                                  IF writelisting > 12 THEN
                                    BEGIN
                                    write(listing,'instance = ',
                                      table[adr].alf);
                                      listcode(f)
                                    END;
                                  k := num_successes;
                                  make(g,right,cp);
                                  IF NOT (op IN [which_,the_]) THEN
                                    IF num_successes > k
                                      THEN GOTO 5;
                                  add := add + 1
                                  END (* FOR j *)
                                END; (* WITH sorttable[i]  IF *)
                    5:
                    IF op IN [which_,first_,the_]
                        THEN indvars := indvars - 1;
                    top := top - 1
                    END (* IF *)
                ELSE (* universal/true or existential/false *)
                    BEGIN
                    k := top; add := -1; i := 0;
                    nexttype;
                    top := k - 1
                    END;
                END;  (* WITH bindingstack *)
            END;
        sort_ :
            IF (table[bindingstack[left].adr].i_sortaddress
                IN table[right].s_sort) = g THEN cp;
        equal :
            IF (bindingstack[left].adr =
                bindingstack[right].adr) = g THEN cp;
        equalc :
            IF (bindingstack[left].adr = right) = g THEN cp;
        true_,false_ :
            IF (op = true_) = g THEN cp;
        not_ :
            make(NOT g, right,cp);
        and_,or_ :
            IF (op = and_) = g THEN make(g,left,sameright) ELSE
                BEGIN
                k := num_successes; make(g,left,cp);
                IF (indvars > 0) OR (k = num_successes)
                     THEN make(g,right,cp)
                END;
        imp_ :
            IF NOT g THEN make(true,left,falseright) ELSE
                BEGIN
                k := num_successes; make(false,left,cp);
                IF (indvars > 0) OR (k = num_successes)
                    THEN make(g,right,cp)
                END;
        iff_ :
            BEGIN
            k := num_successes; make(g,left,trueright);
            IF (indvars > 0) OR (k = num_successes)
                THEN make(NOT g,left,falseright)
            END;
        all_det,some_det,which_det,first_det :
            BEGIN
            top := top + 1;
            IF op IN [which_det,first_det]
                THEN detvars := detvars + 1;
            WITH bindingstack[top] DO
                BEGIN
                var_ptr := left; (* the variable *)
                adr := table[left].p_info;
                IF (op IN [which_det,first_det,some_det]) = g THEN
                    BEGIN (* existential *)
                    FOR i := 0 TO table[adr].p_val - 1 DO
                        BEGIN
                        adr := adr + 1; add := i;
                        k := num_successes; make(g,right,cp);
                        IF NOT (op = which_det) THEN
                            IF num_successes > k THEN GOTO 6;
                        END;
                    6:
                    top := top - 1;
                    IF op IN [which_det,first_det]
                        THEN detvars := detvars - 1;
                    END
                  ELSE
                    BEGIN (* universal *)
                    k := top; add := -1;
                    j := table[adr].p_val - 1;
                    IF writelisting > 12 THEN
                        writeln(listing,'universal with ',
                            j + 1:0,' values');
                    nextdeterminate;
                    top := k - 1
                    END
                END
            END;
        OTHERWISE point('F','internal in "make"            ');
        END; (* CASE *)
  END; (* make *)

(* - - - - -   T R A N S L A T O R   - - - - - *)

PROCEDURE top_level(fsys : symset);
VAR siz,ty : integer; address : integer; ss : sortset;
    tabadr : tablerange;
    current_param : integer;
    savelocation : integer; (* transmit extension to factor *)
    i,j : integer;
    multiplier, adder : integer;
    cx0 : integer;

  FUNCTION hash : hashrange;
  (* NOTE: this is dependent on the PASCAL implementation *)
  VAR x : RECORD CASE boolean OF
                false : (a : identalfa);
                true  : (i1,i2,i3,i4 : integer);
                END;
  BEGIN (* hash *)
  WITH x DO
      BEGIN
      a := ident;
      hash := (i1 + i2 + i3 + i4) MOD prime_number
      END
  END; (* hash *)

  PROCEDURE ent(k : symbol; n : tablerange);
  BEGIN (* ent *)
  lasttable := lasttable + 1;
  IF lasttable > maxtable THEN
      point('F','symbol table overflow         ');
  WITH table[lasttable] DO
      BEGIN alf := ident; ob := k; next := n END
  END; (* ent *)

  PROCEDURE lookup;
  BEGIN (* lookup *)
  IF sentinel > 0 THEN
      BEGIN (* linear search for bound variables *)
      table[sentinel].alf := ident; locatn := lasttable;
      WHILE table[locatn].alf <> ident DO locatn := locatn - 1
      END;
  IF (sentinel = 0) OR (locatn = sentinel) THEN
      BEGIN (* hash search for global identifiers *)
      table[0].alf := ident; locatn := hashtable[hash];
      WHILE table[locatn].alf <> ident DO locatn :=table[locatn].next
      END;
  IF writelisting > 12 THEN
      WITH table[locatn] DO
          writeln(listing,
              'lookup : "',ident,'" at ',locatn:0,' is ',ob)
  END; (* lookup *)

  PROCEDURE enter(k : symbol; VAR where : tablerange);
  VAR h : hashrange;
  BEGIN (* enter *)
  lookup;
  IF locatn > 0 THEN
      point('E','previously declared           ');
  h := hash;
  IF writelisting > 12 THEN
      IF hashtable[h] <> 0 THEN
          IF ident <> table[hashtable[h]].alf THEN
              writeln(listing,'collision ',ident,' = ',
                table[hashtable[h]].alf);
  ent(k,hashtable[h]);
  hashtable[h] := lasttable;
  where := lasttable
  END; (* enter *)

  PROCEDURE gen(o : symbol; l,r : integer);
  BEGIN (* gen *)
  IF cx = maxcode THEN
      point('F','input too big                 ');
  cx := cx + 1;
  WITH code[cx] DO
      BEGIN op := o; left := l; right := r; val := 0 END
  END; (* gen *)

  PROCEDURE typ(fsys : symset; VAR siz,ty : integer; VAR ss : sortset);
  VAR siz1,ty1 : integer; ss1 : sortset; where : tablerange;
  BEGIN (* typ *)
  test(typebegsys,fsys,'start of sort expected        ');
  IF sym IN typebegsys THEN
      CASE sym OF
          leftparenthesis :
              BEGIN
              getsym; siz := 0; ty := 0;
              WHILE sym = identifier DO
                  BEGIN
                  enter(individual_,where);
                  WITH table[where] DO
                    BEGIN i_sortaddress := address; i_ord := siz END;
                  siz := siz + 1; getsym
                  END;
              ss := [lastsort];
              check(rightparenthesis,[],
                  '")" expected                  ');
              IF sym = altern_ THEN
                  point('E','illegal after enumeration     ')
              END;
          identifier :
              BEGIN
              lookup;
              ty := locatn;
              WITH table[locatn] DO
                  CASE ob OF
                    sort_ :
                      BEGIN siz := s_size; ss := s_sort; END;
                    determinable_ :
                      BEGIN
                      END;
                    OTHERWISE
                      point('E','identifier is of wrong kind   ')
                    END; (* CASE *)
              getsym
              END;
          OTHERWISE
              point('E','illegal start of sort         ');
          END; (* CASE *)
  IF sym = altern_ THEN
      BEGIN
      getsym;
      IF sym = leftparenthesis THEN
          point('E','illegal after alternation     ');
      typ(fsys + [altern_],siz1,ty1,ss1);
      siz := siz + siz1; ss := ss + ss1
      END;
  test(fsys,[],'illegal symbol after type     ')
  END; (* typ *)
  PROCEDURE bind(fsys : symset; s : symbol; VAR where : tablerange);
  VAR siz,ty : integer;
  BEGIN (* bind *)
  IF sym = identifier THEN
      BEGIN
      ent(s,0); where := lasttable; getsym;
      check(colon,[semic],'":" expected                  ');
      typ(fsys,siz,ty,ss);
      IF table[ty].ob = sort_ THEN
          WITH table[where] DO
              BEGIN b_sort := ss; b_stackaddress := top END
        ELSE
          WITH table[where] DO
              BEGIN
              ob := succ(s);
              p_params := table[ty].p_params;
              p_mem := table[ty].p_mem;
              p_val := top; (* of the run time stack *)
              p_info := ty
              END
      END
    ELSE point('E','variable expected             ')
  END; (* bind *)

  PROCEDURE tuple(fsys : symset; cx0 : integer);
  VAR i : partyprange;
  BEGIN (* tuple *)
  REPEAT
  getsym;
    IF sym <> identifier THEN
       point('E','identifier expected           ')
     ELSE
       BEGIN
       lookup;
       WITH table[locatn] DO
         CASE ob OF
           individual_ :
              IF NOT(table[i_sortaddress].s_sort
                   <= paramtable[current_param].sorts) THEN
                  point('E','constant has wrong type       ')
              ELSE
                  BEGIN
                  i := paramtable[current_param].firstsort;
                  WHILE i_sortaddress <> partyptable[i].tblptr
                    DO i := i + 1;
                  IF writelisting > 11 THEN
                    BEGIN
                    writeln(listing,'the type of ',alf,' is ',
                      table[partyptable[i].tblptr].alf);
                    writeln(listing,
                      'mult = ',
                        paramtable[current_param].mult:0,
                      ' add = ',
                        partyptable[i].add:0,
                      ' ord = ',i_ord:0);
                    END;
                  WITH code[cx0] DO
                   right := right +
                    paramtable[current_param].mult *
                    (partyptable[i].add + i_ord);
                  END;
           all_,some_,which_,first_,the_ :
              IF NOT(b_sort
                   <= paramtable[current_param].sorts) THEN
                  point('E','variable has wrong type       ')
(* NOTE: it is desirable to weaken the above = to <= so that
subtypes can be used. But this requires further instructions to
skip parameter sorts not included in the binding sorst *)
              ELSE
                  gen(individual_,
                    paramtable[current_param].mult,
                    b_stackaddress);
           OTHERWISE
              point('E','constant or variable expected ')
           END
       END; (* ELSE *)
    getsym;
    WITH paramtable[current_param] DO
     IF islast AND (sym = comma) THEN
       point('E','too many actual parameters    ')
     ELSE IF NOT islast AND (sym <> comma) THEN
       point('E','too few actual parameters     ');
    current_param := current_param + 1;
    UNTIL sym <> comma;
  test(fsys,[],'illegal symbol after tuple ')
  END; (* tuple *)

  PROCEDURE expression(fsys : symset; VAR cx0 : integer);
  VAR left,right : integer; localop : symbol;

    PROCEDURE simpl_expr(fsys : symset; VAR cx0 : integer);
    VAR left,right : integer;

      PROCEDURE term(fsys : symset; VAR cx0 : integer);
      VAR left,right : integer;

          PROCEDURE factor(fsys : symset; VAR cx0 : integer);
          VAR locatn0 : integer; localop : symbol;
          tabadr : tablerange;
          ss : sortset;

          BEGIN (* factor *)
          test(facbegsys,fsys,
              'start of factor expected      ');
          WHILE sym IN facbegsys DO
              BEGIN
              CASE sym OF
                  identifier :
                      BEGIN
                      lookup; locatn0 := locatn;
                      CASE table[locatn].ob OF
                          predicate_,determinate_,
                          all_det,some_det,which_det,first_det :
                            BEGIN
                            current_param := table[locatn].p_params;
                            IF table[locatn0].ob < all_det THEN
                                gen(table[locatn0].ob,locatn0,
                                    table[locatn0].p_mem)
                              ELSE
                                gen(determinable_,locatn0,
                                    table[locatn0].p_mem);

                            code[cx].val := table[locatn0].p_val;
                            cx0 := cx;
                            getsym;
                            IF sym = leftparenthesis THEN
                              BEGIN
                              tuple(fsys + [rightparenthesis],cx0);
                              check(rightparenthesis,
                                [rightbrace,rightangle],
                                '")" expected                  ')
                              END;
                            END; (* predicate_ *)
                          sort_ :
                            BEGIN
                            getsym;
                            IF sym <> leftparenthesis THEN
                              point('E',
                                '"(" expected after sort       ')
                            ELSE
                              BEGIN
                              getsym;
                              IF sym <> identifier THEN
                                point('E',
                                  'identifier expected           ')
                              ELSE
                                BEGIN
                                lookup;
                                WITH table[locatn] DO CASE ob OF
                                  individual_ :
                                    IF table[i_sortaddress].s_sort
                                        <= table[locatn0].s_sort
                                      THEN gen(true_,0,0)
                                      ELSE gen(false_,0,0);
                                  all_,some_,which_,first_,the_ :
                                    gen(sort_,
                                        table[locatn].b_stackaddress,
                                        locatn0);
                                  OTHERWISE
                                    point('E',
                                    'constant or variable expected ')
                                  END; (* CASE,WITH *)
                                cx0 := cx; getsym
                                END;
                              check(rightparenthesis,
                                [rightbrace,rightangle],
                                '")" expected                  ')
                              END
                            END;
                          individual_,all_,some_,which_,first_,the_ :
                            BEGIN
                            getsym;
                            IF sym = equal THEN getsym ELSE
                              point('E',
                                '"=" expected                  ');
                            IF sym <> identifier THEN
                              point('E',
                                'identifier expected           ')
                            ELSE
                              BEGIN
                              lookup;
                              WITH table[locatn] DO CASE ob OF
                                individual_ :
                                  IF table[locatn0].ob = individual_
                                    THEN
                                      IF locatn = locatn0
                                        THEN gen(true_,0,0)
                                        ELSE gen(false_,0,0)
                                    ELSE
                                      gen(equalc,
                                        table[locatn0].b_stackaddress,
                                        locatn);
                                all_,some_,which_,first_,the_:
                                  IF table[locatn0].ob = individual_
                                    THEN
                                      gen(equalc,
                                        table[locatn].b_stackaddress,
                                        locatn0)
                                    ELSE
                                      gen(equal,
                                        table[locatn0].b_stackaddress,
                                        table[locatn].b_stackaddress);
                                OTHERWISE
                                  point('E',
                                    'constant or variable expected ')
                                END; (* CASE *)
                              cx0 := cx; getsym
                              END (* ELSE *)
                            END;
                          OTHERWISE
                            point('E',
                              'identifier is of wrong kind   ')
                          END (* CASE *)
                      END; (* identifier_ *)
                  all_,some_ :
                      BEGIN
                      localop := sym; top := top + 1; getsym;
                      bind(fsys + facbegsys,localop,tabadr);
                      factor(fsys,cx0); top := top - 1;
                      gen(table[tabadr].ob,tabadr,cx0); cx0 := cx
                      END;
                  true_,false_:
                      BEGIN
                      gen(sym,0,0); cx0 := cx;
                      getsym
                      END;
                  not_ :
                      BEGIN
                      getsym;
                      factor(fsys,cx0);
                      gen(not_,0,cx0); cx0 := cx
                      END;
                  leftparenthesis :
                      BEGIN
                      getsym;
                      expression(fsys + [rightparenthesis],cx0);
                      check(rightparenthesis,[rightbrace,rightangle],
                          '")" expected                  ')
                      END;
                  OTHERWISE
                      point('E','start of factor expected      ')
                  END; (* CASE *)
              test(fsys,[leftparenthesis],
                  'illegal symbol after factor   ')
              END;
          END; (* factor *)

      BEGIN (* term *)
      factor(fsys + [and_],cx0);
      IF sym = and_ THEN
          BEGIN
          getsym; term(fsys,right);
          gen(and_,cx0,right); cx0 := cx
          END;
      END; (* term *)

    BEGIN (* simpl_expr *)
    term(fsys + [or_],cx0);
    IF sym = or_ THEN
        BEGIN
        getsym; simpl_expr(fsys,right);
        gen(or_,cx0,right); cx0 := cx
        END;
    END; (* simpl_expr *)

  BEGIN (* expression *)
  simpl_expr(fsys + [iff_,imp_],cx0);
  IF sym IN [iff_,imp_] THEN
      BEGIN
      localop := sym; getsym; expression(fsys,right);
      gen(localop,cx0,right); cx0 := cx
      END;
  END; (* expression *)

  PROCEDURE query(fsys : symset; VAR cx0 : integer);
  VAR tabadr : integer; localop : symbol;
  BEGIN (* query *)
  IF sym IN [which_,first_] THEN
      BEGIN
      localop := sym; top := top + 1; getsym;
      bind(fsys + querybegsys,localop,tabadr);
      query(fsys,cx0); top := top - 1;
      gen(table[tabadr].ob,tabadr,cx0); cx0 := cx
      END
  ELSE expression(fsys,cx0)
  END; (* query *)

  PROCEDURE setatom; (* called as a continuation *)
  VAR i, current_param : integer;
  BEGIN (* setatom *)
  WITH table[savelocation] DO
      BEGIN actualaddress := p_mem; current_param := p_params END;
  FOR i := 1 TO top DO
      BEGIN
      actualaddress := actualaddress +
        paramtable[current_param].mult * bindingstack[i].add;
      current_param := current_param + 1;
      END;
  memory[actualaddress] := table[savelocation].p_val
  END; (* setatom *)

BEGIN (* top_level *)
test(top_levelbegsys,fsys,'command or query expected     ');
IF sym IN top_levelbegsys THEN CASE sym OF
    sort_ :
        BEGIN
        getsym;
        WHILE sym = identifier DO
            BEGIN
            enter(sort_,address);
            lastsort := lastsort + 1;
            sorttable[lastsort].tabl_ptr := address;
            getsym;
            IF sym = equal THEN getsym ELSE
                point('E','"=" expected                  ');
            typ(fsys + [semic],siz,ty,ss);
            sorttable[lastsort].sort_size := siz;
            WITH table[address] DO
                BEGIN
                s_sortaddress := lastsort; s_size := siz; s_sort:= ss
                END;
            IF sym = semic THEN getsym
            END (* WHILE *)
        END;
    predicate_ :
        BEGIN
        getsym;
        WHILE sym = identifier DO
            BEGIN
            enter(predicate_,address);
            getsym;
            multiplier := 1;
            IF sym = leftparenthesis THEN
                BEGIN
                WITH table[address] DO
                    BEGIN
                    p_params := lastparamtable + 1; p_val := 1
                    END;
                REPEAT
                    getsym;
                    typ(fsys + [comma,rightparenthesis],siz,ty,ss);
                    lastparamtable := lastparamtable + 1;
                    WITH paramtable[lastparamtable] DO
                        BEGIN
                        ad := ty;
                        sorts := ss;
                        firstsort := lastpartyptable + 1;
                        paramsize := 0;
                        mult := multiplier;
                        islast := sym <> comma
                        END;
                    adder := 0;
                    FOR i := 1 TO lastsort DO
                        IF i IN ss THEN
                            BEGIN
                            IF writelisting > 9 THEN
                                writeln(listing,
                                    'type = ',
                                    table[sorttable[i].tabl_ptr].alf);
                            WITH paramtable[lastparamtable] DO
                              paramsize :=
                                paramsize + sorttable[i].sort_size;
                            lastpartyptable := lastpartyptable + 1;
                            WITH partyptable[lastpartyptable] DO
                                BEGIN
                                tblptr := sorttable[i].tabl_ptr;
                                add := adder
                                END;
                            adder := adder + sorttable[i].sort_size
                            END; (* IF *)
                    multiplier := multiplier * adder
                    UNTIL sym <> comma;
                IF sym = rightparenthesis THEN getsym ELSE
                    point('E','")" expected                  ');
                END (* IF *)
              ELSE
                table[address].p_params := 0;
            WITH table[address] DO
                BEGIN p_mem := mx; p_info := multiplier END;
            mx := mx + multiplier;
            IF mx > maxmemory THEN
                point('F','not enough memory             ');
            IF sym = equal THEN
                BEGIN (* determinable *)
                getsym;
                check(leftbrace,[leftparenthesis,leftangle],
                    '"{" expected                  ');
                WHILE sym = identifier DO
                    BEGIN (* determinate *)
                    enter(determinate_,tabadr);
                    WITH table[tabadr] DO
                        BEGIN
                        p_params := table[address].p_params;
                        p_mem := table[address].p_mem;
                        p_info := address;
                        p_val := tabadr - address  - 1
                        END;
                    getsym
                    END; (* WHILE determinate *)
                WITH table[address] DO
                    BEGIN
                    ob := determinable_;
                    p_val := tabadr-address
                    END;
                check(rightbrace,[],'"}" expected                  ')
                END; (* determinable *)
            IF sym = semic THEN getsym
            END (* WHILE *)
        END;
    extension_ :
        BEGIN
        getsym;
        WHILE sym = identifier DO
            BEGIN
            lookup;
            WITH table[locatn] DO
                IF NOT (ob IN [predicate_,determinate_]) THEN
                    point('E','predicate expected            ')
                  ELSE
                    savelocation := locatn;
            getsym;
            check(equal,[],'"=" expected                  ');
            check(leftbrace,[],'"{" expected                  ');
            IF sym = the_ THEN
                BEGIN
                getsym;
                IF sym <> leftangle THEN
                    point('E','"<" expected                  ');
                current_param :=  table[savelocation].p_params;
                lasttable := lasttable + 1; sentinel := lasttable;
                cx0 := cx + 1;
                REPEAT
                    getsym; top := top + 1;
                    bind(fsys + [comma,rightangle],the_,tabadr);
                    IF NOT(table[tabadr].b_sort
                        <= paramtable[current_param].sorts) THEN
                          point('E','declaration has wrong type    ');
                    WITH paramtable[current_param] DO
                        IF islast AND (sym = comma) THEN
                          point('E','too many variables in tuple   ')
                        ELSE IF NOT islast AND (sym <> comma) THEN
                          point('E','too few variables in tuple    ');
                    gen(the_,tabadr,cx + 2);
                    current_param := current_param + 1
                    UNTIL sym <> comma;
                check(rightangle,[],'">" expected                  ');
                expression(fsys + [rightbrace],code[cx].right);
                code[cx + 1].op := undefined;
                top := 0; indvars := 0; detvars := 0;
                num_successes := 0;
                IF writelisting > 10 THEN
                    FOR i := 1 TO cx DO listcode(i);
                make(true,cx0,setatom);
                lasttable := sentinel - 1
                END (* IF the *)
              ELSE
                WHILE sym = leftangle DO
                    BEGIN
                    gen(predicate_,savelocation,
                        table[savelocation].p_mem);
                    cx0 := cx;
                    current_param := table[savelocation].p_params;
                    tuple(fsys + [rightangle],cx0);
                    IF writelisting > 10 THEN
                        writeln(listing,'setting ',
                            code[cx0].right);
                    memory[code[cx0].right] :=
                        table[savelocation].p_val;
                    cx := 0;
                    check(rightangle,[rightparenthesis,rightbrace],
                        '">" expected                  ')
                    END; (* WHILE leftangle *)
            check(rightbrace,[rightparenthesis,rightangle],
                '"}" expected                  ');
            IF sym = semic THEN getsym
            END (* WHILE *)
        END;
    show_ :
        BEGIN
        FOR i := 1 TO lasttable DO
            WITH table[i] DO
                BEGIN
                writeresword(reswords[resword_inverse[ob]].alf);
                putch(' ');
                writeident(alf);
                CASE ob OF
                    sort_ :
                        BEGIN
                        END;
                    individual_ :
                        BEGIN
                        putch(':');
                        writeident(table[i_sortaddress].alf)
                        END;
                    predicate_,determinable_ :
                        BEGIN
                        IF p_params > 0 THEN
                            BEGIN
                            putch('(');
                            j := p_params;
                            REPEAT
                              WITH paramtable[j] DO
                                BEGIN
                                writeident(table[ad].alf);
                                IF writelisting > 5 THEN
                                  BEGIN
                                  writeset(paramtable[j].sorts);
                                  putch(' ');
                                  writeinteger(paramsize)
                                  END;
                                IF NOT islast THEN putch(',');
                                IF islast THEN j := 0 ELSE j := j + 1;
                                END;
                              UNTIL j = 0;
                            putch(')'); putch(' ');
                            END; (* IF *)
                        putch('(');  writeinteger(p_info); putch(')');
                        writeline;
                        FOR j := p_mem TO p_mem + p_info - 1 DO
                            putch(chr(memory[j] + ord('0')))
                        END; (* predicate *)
                    determinate_ :
                        BEGIN
                        putch(' ');putch('=');putch(' ');
                        writeident(table[p_info].alf);
                        putch('['); writeinteger(p_val); putch(']')
                        END;
                    END; (* CASE *)
                writeline
                END; (* WITH, FOR *)
        getsym
        END; (* show *)
    quit_ :
        GOTO 99;
    OTHERWISE
        BEGIN
        lasttable := lasttable + 1; sentinel := lasttable;
        top := 0;
        cx := 0;
        query(fsys,cx0);
        IF errorcount > 0 THEN finalise ELSE
            BEGIN
            IF writelisting > 9 THEN
                FOR i := 1 TO cx DO listcode(i);
            code[cx + 1].op := undefined;
              (* see make, predicate_ NOTE *)
            top := 0; indvars := 0; detvars := 0;
            num_successes := 0;
            make(true,cx0,show);
            IF num_successes = 0
                THEN writeident('no              ')
                ELSE writeident('yes             ');
            writeline
            END;
        lasttable := sentinel - 1; sentinel := 0;
        END
    END; (* CASE *)
test(fsys,[],'illegal symbol after top level')
END; (* top_level *)

(* - - - - -   M A I N   - - - - - *)

PROCEDURE writestatistics(VAR f : text);
BEGIN (* writestatistics *)
writeln(f,calls_to_make:0,' calls to make');
END; (* writestatistics *)

BEGIN (* main *)
clock_start  := clock; calls_to_make := 0;
initialise;
typebegsys := [identifier,leftparenthesis];
facbegsys := [identifier,all_,some_,the_,not_,true_,false_,
                leftparenthesis,leftbrace,leftangle];
querybegsys := facbegsys + [which_,first_];
top_levelbegsys := querybegsys +
                [sort_,predicate_,extension_,show_,quit_];
table[0].ob := undefined; lasttable := 0;
FOR h := 0 TO prime_number DO hashtable[h] := 0;
lastparamtable := 0; lastsort := 0; lastpartyptable := 0; mx := 0;
10:
REPEAT
    errorcount := 0; getsym; top_level([period]);
    UNTIL false;
90: ;
99: finalise;
IF statistics > 0 THEN
    BEGIN
    writestatistics(output);
    IF writelisting > 0 THEN writestatistics(listing)
    END
END.
#+end_src

