19-db-query-lang.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> The program</h2>
<div class="outline-text-2" id="text-6">
<p>
The following is the Pascal source file.  It is not quite standard, because it uses the utilities of the previous chapter in an <code>INCLUDE</code> file.  If your Pascal does not allow included files, you will have to physically include that file at the point where the <code>INCLUDE</code> directive occurs, about half a page down.  If your Pascal insists that declarations of labels, types, variables and procedures and functions occur strictly in this order &#x2014; then the various declarations will have to be merged.
</p>

<p>
From the utilities of Chapter~17 procedure <code>check</code> is used extensively to produce an error message in case a required symbol is not seen.  Importantly, the procedure will then accept some reasonable approximation to the required symbol &#x2014; a likely typing error &#x2014; to keep the parser in step with the input.  Note that for small values (1..3) of the utility variable <code>writelisting</code> additional information is written to both the output file and the listing file.  For larger values (10..15) voluminous but sometimes indispensible tracing information will be written to the listing file only.
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">PROGRAM</span> <span style="color: #ffffff; font-weight: bold;">datbas</span>(input,output);

LABEL 10,90,99;

<span style="color: #ff00ff;">CONST</span>
    errormark = <span style="color: #00ff00;">'%DB'</span>;
    list_filename = <span style="color: #00ff00;">'43datbas.lst'</span>;
    reslength = 12; emptyres = <span style="color: #00ff00;">'            '</span>;
    maxrestab = 35;
    identlength = 32;
    emptyident = <span style="color: #00ff00;">'                                '</span>;
    maxstdidenttab = 1; <span style="color: #66f;">(* </span><span style="color: #66f;">dummy *)</span>

<span style="color: #ff00ff;">TYPE</span>
    symbol =
        (undefined,show_,quit_,predicate_,determinable_,determinate_,
        sort_,individual_,extension_,the_,
        all_,all_det,some_,some_det,which_,which_det,first_,first_det,
        and_,iff_,imp_,not_,or_,true_,false_,equal,equalc,
        leftbrace,rightbrace,rightparenthesis,
        comma,period,colon,semic,leftangle,rightangle,altern_,
        <span style="color: #66f;">(* </span><span style="color: #66f;">compulsory for scanutilities: *)</span>
        charconst,stringconst,numberconst,
        leftparenthesis,hyphen,identifier);
    standardident = (dummy);

%INCLUDE <span style="color: #00ff00;">'41SCANUT.PAS'</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">initialise</span>;
<span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">initialise *)</span>
iniscanner;
specials_repeat := [<span style="color: #00ff00;">'='</span>];
erw( <span style="color: #00ff00;">'(           '</span> ,leftparenthesis); <span style="color: #66f;">(* </span><span style="color: #66f;">not used *)</span>
erw( <span style="color: #00ff00;">')           '</span> ,rightparenthesis);
erw( <span style="color: #00ff00;">',           '</span> ,comma);
erw( <span style="color: #00ff00;">'.           '</span> ,period);
erw( <span style="color: #00ff00;">':           '</span> ,colon);
erw( <span style="color: #00ff00;">';           '</span> ,semic);
erw( <span style="color: #00ff00;">'&lt;           '</span> ,leftangle);
erw( <span style="color: #00ff00;">'=           '</span> ,equal);
erw( <span style="color: #00ff00;">'&gt;           '</span> ,rightangle);
erw( <span style="color: #00ff00;">'ALL         '</span> ,all_);
erw( <span style="color: #00ff00;">'AND         '</span> ,and_);
erw( <span style="color: #00ff00;">'DETERMINABLE'</span> ,determinable_);
erw( <span style="color: #00ff00;">'DETERMINATE '</span> ,determinate_);
erw( <span style="color: #00ff00;">'EXTENSION   '</span> ,extension_);
erw( <span style="color: #00ff00;">'FALSE       '</span> ,false_);
erw( <span style="color: #00ff00;">'FIRST       '</span> ,first_);
erw( <span style="color: #00ff00;">'IFF         '</span> ,iff_);
erw( <span style="color: #00ff00;">'IMP         '</span> ,imp_);
erw( <span style="color: #00ff00;">'INDIVIDUAL  '</span> ,individual_);
erw( <span style="color: #00ff00;">'NOT         '</span> ,not_);
erw( <span style="color: #00ff00;">'OR          '</span> ,or_);
erw( <span style="color: #00ff00;">'PREDICATE   '</span> ,predicate_);
erw( <span style="color: #00ff00;">'QUIT        '</span> ,quit_);
erw( <span style="color: #00ff00;">'SHOW        '</span> ,show_);
erw( <span style="color: #00ff00;">'SOME        '</span> ,some_);
erw( <span style="color: #00ff00;">'SORT        '</span> ,sort_);
erw( <span style="color: #00ff00;">'THE         '</span> ,the_);
erw( <span style="color: #00ff00;">'TRUE        '</span>, true_);
erw( <span style="color: #00ff00;">'WHICH       '</span> ,which_);
erw( <span style="color: #00ff00;">'{           '</span> ,leftbrace);
erw( <span style="color: #00ff00;">'|           '</span> ,altern_);
erw( <span style="color: #00ff00;">'}           '</span> ,rightbrace);
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">initialise *)</span>

<span style="color: #ff00ff;">CONST</span>
    prime_number = 47;  <span style="color: #66f;">(* </span><span style="color: #66f;">e.g. 997 *)</span>
    maxtable = 300;
    maxparamtable = 500;
    maxsorts = 31;
    maxpartyptable = 1000;
    maxcode = 100;
    maxmemory = 1000;
    maxbindingstack = 10;
    maxval = 225;
<span style="color: #ff00ff;">TYPE</span>
    sortrange = 0 .. maxsorts;
    sortset = <span style="color: #ff00ff;">SET</span> <span style="color: #00ffff;">OF</span> sortrange;
    tablerange = 0..maxtable;
    hashrange = 0..prime_number;
    paramrange = 0..maxparamtable;
    partyprange = 1..maxpartyptable;
    memrange = 0..maxmemory;
    coderange = 0..maxcode;
    stackrange = 0..maxbindingstack;
    valrange = 0..maxval;
<span style="color: #ff00ff;">VAR</span>
    facbegsys,querybegsys,top_levelbegsys,typebegsys : symset;
    table : <span style="color: #ff00ff;">ARRAY</span> [tablerange] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">RECORD</span>
                alf : identalfa; next : tablerange;
                <span style="color: #00ffff;">CASE</span> ob : symbol <span style="color: #00ffff;">OF</span>
                    sort_ :
                        (s_sort : sortset;
                         s_sortaddress : sortrange;
                         s_size : tablerange);
                    individual_ :
                        (i_sortaddress : sortrange;
                         i_ord : tablerange);
                    predicate_,determinable_,determinate_,
                    all_det,some_det,which_det,first_det :
                        (p_params : partyprange;
                         p_mem : memrange;
                         p_val : valrange;
                         p_info : memrange <span style="color: #66f;">(* </span><span style="color: #66f;">only for trace *)</span> );
                    all_,some_,which_,first_,the_ :
                        (b_sort : sortset;
                         b_stackaddress : stackrange);
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE, RECORD *)</span>
    lasttable,locatn,sentinel : tablerange;
    hashtable : <span style="color: #ff00ff;">ARRAY</span> [hashrange] <span style="color: #00ffff;">OF</span> tablerange;
    h : hashrange;
    sorttable : <span style="color: #ff00ff;">ARRAY</span> [sortrange] <span style="color: #00ffff;">OF</span>
        <span style="color: #ff00ff;">RECORD</span> tabl_ptr : tablerange; sort_size : tablerange <span style="color: #00ffff;">END</span>;
    lastsort : sortrange;

    paramtable : <span style="color: #ff00ff;">ARRAY</span> [paramrange] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">RECORD</span>
        ad : <span style="color: #ff00ff;">integer</span>;
        sorts : sortset;
        firstsort : partyprange;
        paramsize : <span style="color: #ff00ff;">integer</span>;
        mult : <span style="color: #ff00ff;">integer</span>;
        islast : <span style="color: #ff00ff;">boolean</span>
        <span style="color: #00ffff;">END</span>;
    lastparamtable : paramrange;
    partyptable : <span style="color: #ff00ff;">ARRAY</span> [partyprange] <span style="color: #00ffff;">OF</span>
        <span style="color: #ff00ff;">RECORD</span> tblptr : tablerange; add : <span style="color: #ff00ff;">integer</span> <span style="color: #00ffff;">END</span>;
    lastpartyptable : partyprange;

    code : <span style="color: #ff00ff;">ARRAY</span> [coderange] <span style="color: #00ffff;">OF</span>
        <span style="color: #ff00ff;">RECORD</span>
            op : symbol;
            left:tablerange; right : memrange;
            val : valrange
            <span style="color: #00ffff;">END</span>;
    cx : coderange;
    memory : <span style="color: #ff00ff;">ARRAY</span> [memrange] <span style="color: #00ffff;">OF</span> valrange;
    mx : memrange;

    bindingstack : <span style="color: #ff00ff;">ARRAY</span> [stackrange] <span style="color: #00ffff;">OF</span>
        <span style="color: #ff00ff;">RECORD</span> add,adr,var_ptr : tablerange <span style="color: #00ffff;">END</span>;
    top,indvars,detvars : stackrange;
    actualaddress : memrange;
    num_successes : <span style="color: #ff00ff;">integer</span>;
    clock_start : <span style="color: #ff00ff;">integer</span>;
    calls_to_make : <span style="color: #ff00ff;">integer</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writeset</span>(s : sortset);
<span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span>
putch(<span style="color: #00ff00;">'['</span>);
<span style="color: #00ffff;">FOR</span> i := 0 <span style="color: #00ffff;">TO</span> maxsorts <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">IF</span> i <span style="color: #00ffff;">IN</span> s <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">BEGIN</span> putch(<span style="color: #00ff00;">' '</span>); writeinteger(i) <span style="color: #00ffff;">END</span>;
putch(<span style="color: #00ff00;">']'</span>)
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writeset *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   I N T E R P R E T E R   - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">listcode</span>(i : coderange);
<span style="color: #00ffff;">BEGIN</span>
<span style="color: #00ffff;">WITH</span> code[i] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">write</span>(listing,i:4,<span style="color: #00ff00;">'    '</span>,op,left:4,right:4,<span style="color: #00ff00;">'    '</span>);
    <span style="color: #00ffff;">IF</span> op <span style="color: #00ffff;">IN</span> [predicate_,determinable_,determinate_,
              all_,some_,which_,first_,the_] <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">write</span>(listing,table[left].alf,<span style="color: #00ff00;">' ('</span>,val:0,<span style="color: #00ff00;">')'</span>);
        <span style="color: #00ffff;">IF</span> op = determinate_ <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'('</span>,val:0,<span style="color: #00ff00;">')'</span>)
        <span style="color: #00ffff;">END</span>;
    writeln(listing)
    <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">listcode *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">show</span>;
<span style="color: #ff00ff;">VAR</span> i,j : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">show *)</span>
num_successes := num_successes + 1;
writeinteger(num_successes); putch(<span style="color: #00ff00;">':'</span>); writeline;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> indvars + detvars <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">WITH</span> bindingstack[i] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">FOR</span> j := 1 <span style="color: #00ffff;">TO</span> 4 <span style="color: #00ffff;">DO</span> putch(<span style="color: #00ff00;">' '</span>);
        writeident(table[var_ptr].alf);
        putch(<span style="color: #00ff00;">' '</span>); putch(<span style="color: #00ff00;">'='</span>); putch(<span style="color: #00ff00;">' '</span>);
        writeident(table[adr].alf); writeline
        <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">show *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">make</span>(g : <span style="color: #ff00ff;">boolean</span>; f : coderange; PROCEDURE cp);
LABEL 5,6;
<span style="color: #ff00ff;">VAR</span> i,j,k : <span style="color: #ff00ff;">integer</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">trueright</span>;
    <span style="color: #00ffff;">BEGIN</span> make(true,code[f].right,cp) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">falseright</span>;
    <span style="color: #00ffff;">BEGIN</span> make(false,code[f].right,cp) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">sameright</span>;
    <span style="color: #00ffff;">BEGIN</span> make(g,code[f].right,cp) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">popstack</span>;
    <span style="color: #00ffff;">BEGIN</span> top := k - 1; cp <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">nexttype</span>;
    <span style="color: #ff00ff;">VAR</span> s : sortset;

        <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">nextinstance</span>(PROCEDURE cp);

            <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">furtherinstance</span>;
            <span style="color: #00ffff;">BEGIN</span> nextinstance(cp) <span style="color: #00ffff;">END</span>;

        <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">nextinstance *)</span>
        j := j + 1;
        <span style="color: #00ffff;">WITH</span> sorttable[i] <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">IF</span> j &gt; tabl_ptr + sort_size <span style="color: #00ffff;">THEN</span> nexttype <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">IF</span> writelisting &gt; 12 <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'instance = '</span>,table[j].alf,<span style="color: #00ff00;">' in '</span>);
                    listcode(f)
                    <span style="color: #00ffff;">END</span>;
                <span style="color: #00ffff;">WITH</span> bindingstack[k] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span> adr := j; add := add + 1 <span style="color: #00ffff;">END</span>;
                <span style="color: #00ffff;">IF</span> writelisting &gt; 10  <span style="color: #00ffff;">THEN</span>
                    writeln(listing,<span style="color: #00ff00;">'universal instance, add = '</span>,
                        bindingstack[k].add:0);
                make(g,code[f].right,furtherinstance)
                <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">nextinstance *)</span>

    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">nexttype *)</span>
    <span style="color: #00ffff;">IF</span> i &gt; lastsort <span style="color: #00ffff;">THEN</span> popstack <span style="color: #00ffff;">ELSE</span>
        <span style="color: #00ffff;">BEGIN</span>
        s := table[code[f].left].b_sort
             + [lastsort + 1]; <span style="color: #66f;">(* </span><span style="color: #66f;">sentinel *)</span>
        <span style="color: #00ffff;">REPEAT</span> i := i + 1 <span style="color: #00ffff;">UNTIL</span> i <span style="color: #00ffff;">IN</span> s;
        <span style="color: #00ffff;">IF</span> i &gt; lastsort <span style="color: #00ffff;">THEN</span> popstack <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            j := sorttable[i].tabl_ptr;
            nextinstance(nexttype)
            <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">nexttype *)</span>

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">nextdeterminate</span>;
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">nextdeterminate *)</span>
    <span style="color: #00ffff;">WITH</span> bindingstack[k] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        add := add + 1;
        <span style="color: #00ffff;">IF</span> writelisting &gt; 13 <span style="color: #00ffff;">THEN</span>
            writeln(listing,<span style="color: #00ff00;">'add = '</span>,add:0);
        <span style="color: #00ffff;">IF</span> add &gt; j <span style="color: #00ffff;">THEN</span> popstack <span style="color: #00ffff;">ELSE</span>
            make(g,code[f].right,nextdeterminate)
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">nextdeterminate *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">make *)</span>
calls_to_make := calls_to_make + 1;
<span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #00ffff;">write</span>(listing,g:1); listcode(f) <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">WITH</span> code[f] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>
        predicate_,determinate_,determinable_ :
            <span style="color: #00ffff;">BEGIN</span>
            actualaddress := right;
            <span style="color: #66f;">(* </span><span style="color: #66f;">NOTE that the following requires the LAST code</span>
<span style="color: #66f;">               to be a dummy to stop previous query interfering *)</span>
            i := f + 1;
            <span style="color: #00ffff;">WHILE</span> code[i].op = individual_ <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    <span style="color: #00ffff;">write</span>(listing,g:1,<span style="color: #00ff00;">'  '</span>);
                    listcode(i)
                    <span style="color: #00ffff;">END</span>;
                <span style="color: #00ffff;">WITH</span> code[i] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    actualaddress :=
                        actualaddress +
                            left * bindingstack[right].add;
                    <span style="color: #00ffff;">IF</span> writelisting &gt; 13 <span style="color: #00ffff;">THEN</span>
                        <span style="color: #00ffff;">WITH</span> bindingstack[right] <span style="color: #00ffff;">DO</span>
                          writeln(listing,table[var_ptr].alf,
                            <span style="color: #00ff00;">' := '</span>,table[adr].alf)
                    <span style="color: #00ffff;">END</span>;
<span style="color: #66f;">(* </span><span style="color: #66f;">here would be a correction for sorts in parameter that</span>
<span style="color: #66f;">  are not sorts in the binding; add (size * multiplier *)</span>
                i := i + 1
                <span style="color: #00ffff;">END</span>;
            <span style="color: #00ffff;">IF</span> op = determinable_
                <span style="color: #00ffff;">THEN</span> i := bindingstack[val].add
                <span style="color: #00ffff;">ELSE</span> i := val;
            <span style="color: #00ffff;">IF</span> (memory[actualaddress] = i) = g <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span> writeln(listing,<span style="color: #00ff00;">'SUCCESS'</span>);
                cp
                <span style="color: #00ffff;">END</span>
              <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span> writeln(listing,<span style="color: #00ff00;">'FAIL'</span>)
            <span style="color: #00ffff;">END</span>;
        all_,some_,which_,first_,the_ :
            <span style="color: #00ffff;">BEGIN</span>
            top := top + 1;
            <span style="color: #00ffff;">IF</span> op <span style="color: #00ffff;">IN</span> [which_,first_ ]
                <span style="color: #00ffff;">THEN</span> indvars := indvars + 1;
            <span style="color: #00ffff;">WITH</span> bindingstack[top] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                var_ptr := left; add := 0;
                <span style="color: #00ffff;">IF</span> (op <span style="color: #00ffff;">IN</span> [some_,which_,first_,the_ ]) = g <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastsort <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">IF</span> i <span style="color: #00ffff;">IN</span> table[left].b_sort <span style="color: #00ffff;">THEN</span>
                            <span style="color: #00ffff;">WITH</span> sorttable[i] <span style="color: #00ffff;">DO</span>
                                <span style="color: #00ffff;">BEGIN</span>
                                <span style="color: #00ffff;">IF</span> writelisting &gt; 11 <span style="color: #00ffff;">THEN</span>
                                  <span style="color: #00ffff;">BEGIN</span>
                                  <span style="color: #00ffff;">write</span>(listing,
                                    <span style="color: #00ff00;">'sort is: '</span>,table[tabl_ptr].alf);
                                  listcode(f)
                                  <span style="color: #00ffff;">END</span>;
                                <span style="color: #00ffff;">FOR</span> j := tabl_ptr + 1 <span style="color: #00ffff;">TO</span>
                                    tabl_ptr + sort_size  <span style="color: #00ffff;">DO</span>
                                  <span style="color: #00ffff;">BEGIN</span>
                                  adr := j;
                                  <span style="color: #00ffff;">IF</span> writelisting &gt; 12 <span style="color: #00ffff;">THEN</span>
                                    <span style="color: #00ffff;">BEGIN</span>
                                    <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'instance = '</span>,
                                      table[adr].alf);
                                      listcode(f)
                                    <span style="color: #00ffff;">END</span>;
                                  k := num_successes;
                                  make(g,right,cp);
                                  <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (op <span style="color: #00ffff;">IN</span> [which_,the_]) <span style="color: #00ffff;">THEN</span>
                                    <span style="color: #00ffff;">IF</span> num_successes &gt; k
                                      <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">5</span>;
                                  add := add + 1
                                  <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">FOR j *)</span>
                                <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WITH sorttable[i]  IF *)</span>
                    5:
                    <span style="color: #00ffff;">IF</span> op <span style="color: #00ffff;">IN</span> [which_,first_,the_]
                        <span style="color: #00ffff;">THEN</span> indvars := indvars - 1;
                    top := top - 1
                    <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">IF *)</span>
                <span style="color: #00ffff;">ELSE</span> <span style="color: #66f;">(* </span><span style="color: #66f;">universal/true or existential/false *)</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    k := top; add := -1; i := 0;
                    nexttype;
                    top := k - 1
                    <span style="color: #00ffff;">END</span>;
                <span style="color: #00ffff;">END</span>;  <span style="color: #66f;">(* </span><span style="color: #66f;">WITH bindingstack *)</span>
            <span style="color: #00ffff;">END</span>;
        sort_ :
            <span style="color: #00ffff;">IF</span> (table[bindingstack[left].adr].i_sortaddress
                <span style="color: #00ffff;">IN</span> table[right].s_sort) = g <span style="color: #00ffff;">THEN</span> cp;
        equal :
            <span style="color: #00ffff;">IF</span> (bindingstack[left].adr =
                bindingstack[right].adr) = g <span style="color: #00ffff;">THEN</span> cp;
        equalc :
            <span style="color: #00ffff;">IF</span> (bindingstack[left].adr = right) = g <span style="color: #00ffff;">THEN</span> cp;
        true_,false_ :
            <span style="color: #00ffff;">IF</span> (op = true_) = g <span style="color: #00ffff;">THEN</span> cp;
        not_ :
            make(<span style="color: #00ffff;">NOT</span> g, right,cp);
        and_,or_ :
            <span style="color: #00ffff;">IF</span> (op = and_) = g <span style="color: #00ffff;">THEN</span> make(g,left,sameright) <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span>
                k := num_successes; make(g,left,cp);
                <span style="color: #00ffff;">IF</span> (indvars &gt; 0) <span style="color: #00ffff;">OR</span> (k = num_successes)
                     <span style="color: #00ffff;">THEN</span> make(g,right,cp)
                <span style="color: #00ffff;">END</span>;
        imp_ :
            <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> g <span style="color: #00ffff;">THEN</span> make(true,left,falseright) <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span>
                k := num_successes; make(false,left,cp);
                <span style="color: #00ffff;">IF</span> (indvars &gt; 0) <span style="color: #00ffff;">OR</span> (k = num_successes)
                    <span style="color: #00ffff;">THEN</span> make(g,right,cp)
                <span style="color: #00ffff;">END</span>;
        iff_ :
            <span style="color: #00ffff;">BEGIN</span>
            k := num_successes; make(g,left,trueright);
            <span style="color: #00ffff;">IF</span> (indvars &gt; 0) <span style="color: #00ffff;">OR</span> (k = num_successes)
                <span style="color: #00ffff;">THEN</span> make(<span style="color: #00ffff;">NOT</span> g,left,falseright)
            <span style="color: #00ffff;">END</span>;
        all_det,some_det,which_det,first_det :
            <span style="color: #00ffff;">BEGIN</span>
            top := top + 1;
            <span style="color: #00ffff;">IF</span> op <span style="color: #00ffff;">IN</span> [which_det,first_det]
                <span style="color: #00ffff;">THEN</span> detvars := detvars + 1;
            <span style="color: #00ffff;">WITH</span> bindingstack[top] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                var_ptr := left; <span style="color: #66f;">(* </span><span style="color: #66f;">the variable *)</span>
                adr := table[left].p_info;
                <span style="color: #00ffff;">IF</span> (op <span style="color: #00ffff;">IN</span> [which_det,first_det,some_det]) = g <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">existential *)</span>
                    <span style="color: #00ffff;">FOR</span> i := 0 <span style="color: #00ffff;">TO</span> table[adr].p_val - 1 <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        adr := adr + 1; add := i;
                        k := num_successes; make(g,right,cp);
                        <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (op = which_det) <span style="color: #00ffff;">THEN</span>
                            <span style="color: #00ffff;">IF</span> num_successes &gt; k <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">6</span>;
                        <span style="color: #00ffff;">END</span>;
                    6:
                    top := top - 1;
                    <span style="color: #00ffff;">IF</span> op <span style="color: #00ffff;">IN</span> [which_det,first_det]
                        <span style="color: #00ffff;">THEN</span> detvars := detvars - 1;
                    <span style="color: #00ffff;">END</span>
                  <span style="color: #00ffff;">ELSE</span>
                    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">universal *)</span>
                    k := top; add := -1;
                    j := table[adr].p_val - 1;
                    <span style="color: #00ffff;">IF</span> writelisting &gt; 12 <span style="color: #00ffff;">THEN</span>
                        writeln(listing,<span style="color: #00ff00;">'universal with '</span>,
                            j + 1:0,<span style="color: #00ff00;">' values'</span>);
                    nextdeterminate;
                    top := k - 1
                    <span style="color: #00ffff;">END</span>
                <span style="color: #00ffff;">END</span>
            <span style="color: #00ffff;">END</span>;
        OTHERWISE point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal in "make"            '</span>);
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">make *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   T R A N S L A T O R   - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">top_level</span>(fsys : symset);
<span style="color: #ff00ff;">VAR</span> siz,ty : <span style="color: #ff00ff;">integer</span>; address : <span style="color: #ff00ff;">integer</span>; ss : sortset;
    tabadr : tablerange;
    current_param : <span style="color: #ff00ff;">integer</span>;
    savelocation : <span style="color: #ff00ff;">integer</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">transmit extension to factor *)</span>
    i,j : <span style="color: #ff00ff;">integer</span>;
    multiplier, adder : <span style="color: #ff00ff;">integer</span>;
    cx0 : <span style="color: #ff00ff;">integer</span>;

  <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">hash</span> : hashrange;
  <span style="color: #66f;">(* </span><span style="color: #66f;">NOTE: this is dependent on the PASCAL implementation *)</span>
  <span style="color: #ff00ff;">VAR</span> x : <span style="color: #ff00ff;">RECORD</span> <span style="color: #00ffff;">CASE</span> <span style="color: #ff00ff;">boolean</span> <span style="color: #00ffff;">OF</span>
                false : (a : identalfa);
                true  : (i1,i2,i3,i4 : <span style="color: #ff00ff;">integer</span>);
                <span style="color: #00ffff;">END</span>;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">hash *)</span>
  <span style="color: #00ffff;">WITH</span> x <span style="color: #00ffff;">DO</span>
      <span style="color: #00ffff;">BEGIN</span>
      a := ident;
      hash := (i1 + i2 + i3 + i4) <span style="color: #00ffff;">MOD</span> prime_number
      <span style="color: #00ffff;">END</span>
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">hash *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">ent</span>(k : symbol; n : tablerange);
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">ent *)</span>
  lasttable := lasttable + 1;
  <span style="color: #00ffff;">IF</span> lasttable &gt; maxtable <span style="color: #00ffff;">THEN</span>
      point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'symbol table overflow         '</span>);
  <span style="color: #00ffff;">WITH</span> table[lasttable] <span style="color: #00ffff;">DO</span>
      <span style="color: #00ffff;">BEGIN</span> alf := ident; ob := k; next := n <span style="color: #00ffff;">END</span>
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">ent *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">lookup</span>;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">lookup *)</span>
  <span style="color: #00ffff;">IF</span> sentinel &gt; 0 <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">linear search for bound variables *)</span>
      table[sentinel].alf := ident; locatn := lasttable;
      <span style="color: #00ffff;">WHILE</span> table[locatn].alf &lt;&gt; ident <span style="color: #00ffff;">DO</span> locatn := locatn - 1
      <span style="color: #00ffff;">END</span>;
  <span style="color: #00ffff;">IF</span> (sentinel = 0) <span style="color: #00ffff;">OR</span> (locatn = sentinel) <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">hash search for global identifiers *)</span>
      table[0].alf := ident; locatn := hashtable[hash];
      <span style="color: #00ffff;">WHILE</span> table[locatn].alf &lt;&gt; ident <span style="color: #00ffff;">DO</span> locatn :=table[locatn].next
      <span style="color: #00ffff;">END</span>;
  <span style="color: #00ffff;">IF</span> writelisting &gt; 12 <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">WITH</span> table[locatn] <span style="color: #00ffff;">DO</span>
          writeln(listing,
              <span style="color: #00ff00;">'lookup : "'</span>,ident,<span style="color: #00ff00;">'" at '</span>,locatn:0,<span style="color: #00ff00;">' is '</span>,ob)
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">lookup *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">enter</span>(k : symbol; <span style="color: #ff00ff;">VAR</span> where : tablerange);
  <span style="color: #ff00ff;">VAR</span> h : hashrange;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">enter *)</span>
  lookup;
  <span style="color: #00ffff;">IF</span> locatn &gt; 0 <span style="color: #00ffff;">THEN</span>
      point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'previously declared           '</span>);
  h := hash;
  <span style="color: #00ffff;">IF</span> writelisting &gt; 12 <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">IF</span> hashtable[h] &lt;&gt; 0 <span style="color: #00ffff;">THEN</span>
          <span style="color: #00ffff;">IF</span> ident &lt;&gt; table[hashtable[h]].alf <span style="color: #00ffff;">THEN</span>
              writeln(listing,<span style="color: #00ff00;">'collision '</span>,ident,<span style="color: #00ff00;">' = '</span>,
                table[hashtable[h]].alf);
  ent(k,hashtable[h]);
  hashtable[h] := lasttable;
  where := lasttable
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">enter *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">gen</span>(o : symbol; l,r : <span style="color: #ff00ff;">integer</span>);
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">gen *)</span>
  <span style="color: #00ffff;">IF</span> cx = maxcode <span style="color: #00ffff;">THEN</span>
      point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'input too big                 '</span>);
  cx := cx + 1;
  <span style="color: #00ffff;">WITH</span> code[cx] <span style="color: #00ffff;">DO</span>
      <span style="color: #00ffff;">BEGIN</span> op := o; left := l; right := r; val := 0 <span style="color: #00ffff;">END</span>
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">gen *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">typ</span>(fsys : symset; <span style="color: #ff00ff;">VAR</span> siz,ty : <span style="color: #ff00ff;">integer</span>; <span style="color: #ff00ff;">VAR</span> ss : sortset);
  <span style="color: #ff00ff;">VAR</span> siz1,ty1 : <span style="color: #ff00ff;">integer</span>; ss1 : sortset; where : tablerange;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">typ *)</span>
  test(typebegsys,fsys,<span style="color: #00ff00;">'start of sort expected        '</span>);
  <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> typebegsys <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">CASE</span> sym <span style="color: #00ffff;">OF</span>
          leftparenthesis :
              <span style="color: #00ffff;">BEGIN</span>
              getsym; siz := 0; ty := 0;
              <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
                  <span style="color: #00ffff;">BEGIN</span>
                  enter(individual_,where);
                  <span style="color: #00ffff;">WITH</span> table[where] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span> i_sortaddress := address; i_ord := siz <span style="color: #00ffff;">END</span>;
                  siz := siz + 1; getsym
                  <span style="color: #00ffff;">END</span>;
              ss := [lastsort];
              check(rightparenthesis,[],
                  <span style="color: #00ff00;">'")" expected                  '</span>);
              <span style="color: #00ffff;">IF</span> sym = altern_ <span style="color: #00ffff;">THEN</span>
                  point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'illegal after enumeration     '</span>)
              <span style="color: #00ffff;">END</span>;
          identifier :
              <span style="color: #00ffff;">BEGIN</span>
              lookup;
              ty := locatn;
              <span style="color: #00ffff;">WITH</span> table[locatn] <span style="color: #00ffff;">DO</span>
                  <span style="color: #00ffff;">CASE</span> ob <span style="color: #00ffff;">OF</span>
                    sort_ :
                      <span style="color: #00ffff;">BEGIN</span> siz := s_size; ss := s_sort; <span style="color: #00ffff;">END</span>;
                    determinable_ :
                      <span style="color: #00ffff;">BEGIN</span>
                      <span style="color: #00ffff;">END</span>;
                    OTHERWISE
                      point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'identifier is of wrong kind   '</span>)
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
              getsym
              <span style="color: #00ffff;">END</span>;
          OTHERWISE
              point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'illegal start of sort         '</span>);
          <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
  <span style="color: #00ffff;">IF</span> sym = altern_ <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">BEGIN</span>
      getsym;
      <span style="color: #00ffff;">IF</span> sym = leftparenthesis <span style="color: #00ffff;">THEN</span>
          point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'illegal after alternation     '</span>);
      typ(fsys + [altern_],siz1,ty1,ss1);
      siz := siz + siz1; ss := ss + ss1
      <span style="color: #00ffff;">END</span>;
  test(fsys,[],<span style="color: #00ff00;">'illegal symbol after type     '</span>)
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">typ *)</span>
  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">bind</span>(fsys : symset; s : symbol; <span style="color: #ff00ff;">VAR</span> where : tablerange);
  <span style="color: #ff00ff;">VAR</span> siz,ty : <span style="color: #ff00ff;">integer</span>;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">bind *)</span>
  <span style="color: #00ffff;">IF</span> sym = identifier <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">BEGIN</span>
      ent(s,0); where := lasttable; getsym;
      check(colon,[semic],<span style="color: #00ff00;">'":" expected                  '</span>);
      typ(fsys,siz,ty,ss);
      <span style="color: #00ffff;">IF</span> table[ty].ob = sort_ <span style="color: #00ffff;">THEN</span>
          <span style="color: #00ffff;">WITH</span> table[where] <span style="color: #00ffff;">DO</span>
              <span style="color: #00ffff;">BEGIN</span> b_sort := ss; b_stackaddress := top <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">ELSE</span>
          <span style="color: #00ffff;">WITH</span> table[where] <span style="color: #00ffff;">DO</span>
              <span style="color: #00ffff;">BEGIN</span>
              ob := succ(s);
              p_params := table[ty].p_params;
              p_mem := table[ty].p_mem;
              p_val := top; <span style="color: #66f;">(* </span><span style="color: #66f;">of the run time stack *)</span>
              p_info := ty
              <span style="color: #00ffff;">END</span>
      <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">ELSE</span> point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'variable expected             '</span>)
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">bind *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">tuple</span>(fsys : symset; cx0 : <span style="color: #ff00ff;">integer</span>);
  <span style="color: #ff00ff;">VAR</span> i : partyprange;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">tuple *)</span>
  <span style="color: #00ffff;">REPEAT</span>
  getsym;
    <span style="color: #00ffff;">IF</span> sym &lt;&gt; identifier <span style="color: #00ffff;">THEN</span>
       point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'identifier expected           '</span>)
     <span style="color: #00ffff;">ELSE</span>
       <span style="color: #00ffff;">BEGIN</span>
       lookup;
       <span style="color: #00ffff;">WITH</span> table[locatn] <span style="color: #00ffff;">DO</span>
         <span style="color: #00ffff;">CASE</span> ob <span style="color: #00ffff;">OF</span>
           individual_ :
              <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span>(table[i_sortaddress].s_sort
                   &lt;= paramtable[current_param].sorts) <span style="color: #00ffff;">THEN</span>
                  point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'constant has wrong type       '</span>)
              <span style="color: #00ffff;">ELSE</span>
                  <span style="color: #00ffff;">BEGIN</span>
                  i := paramtable[current_param].firstsort;
                  <span style="color: #00ffff;">WHILE</span> i_sortaddress &lt;&gt; partyptable[i].tblptr
                    <span style="color: #00ffff;">DO</span> i := i + 1;
                  <span style="color: #00ffff;">IF</span> writelisting &gt; 11 <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    writeln(listing,<span style="color: #00ff00;">'the type of '</span>,alf,<span style="color: #00ff00;">' is '</span>,
                      table[partyptable[i].tblptr].alf);
                    writeln(listing,
                      <span style="color: #00ff00;">'mult = '</span>,
                        paramtable[current_param].mult:0,
                      <span style="color: #00ff00;">' add = '</span>,
                        partyptable[i].add:0,
                      <span style="color: #00ff00;">' ord = '</span>,i_ord:0);
                    <span style="color: #00ffff;">END</span>;
                  <span style="color: #00ffff;">WITH</span> code[cx0] <span style="color: #00ffff;">DO</span>
                   right := right +
                    paramtable[current_param].mult *
                    (partyptable[i].add + i_ord);
                  <span style="color: #00ffff;">END</span>;
           all_,some_,which_,first_,the_ :
              <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span>(b_sort
                   &lt;= paramtable[current_param].sorts) <span style="color: #00ffff;">THEN</span>
                  point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'variable has wrong type       '</span>)
<span style="color: #66f;">(* </span><span style="color: #66f;">NOTE: it is desirable to weaken the above = to &lt;= so that</span>
<span style="color: #66f;">subtypes can be used. But this requires further instructions to</span>
<span style="color: #66f;">skip parameter sorts not included in the binding sorst *)</span>
              <span style="color: #00ffff;">ELSE</span>
                  gen(individual_,
                    paramtable[current_param].mult,
                    b_stackaddress);
           OTHERWISE
              point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'constant or variable expected '</span>)
           <span style="color: #00ffff;">END</span>
       <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">ELSE *)</span>
    getsym;
    <span style="color: #00ffff;">WITH</span> paramtable[current_param] <span style="color: #00ffff;">DO</span>
     <span style="color: #00ffff;">IF</span> islast <span style="color: #00ffff;">AND</span> (sym = comma) <span style="color: #00ffff;">THEN</span>
       point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'too many actual parameters    '</span>)
     <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> islast <span style="color: #00ffff;">AND</span> (sym &lt;&gt; comma) <span style="color: #00ffff;">THEN</span>
       point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'too few actual parameters     '</span>);
    current_param := current_param + 1;
    <span style="color: #00ffff;">UNTIL</span> sym &lt;&gt; comma;
  test(fsys,[],<span style="color: #00ff00;">'illegal symbol after tuple '</span>)
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">tuple *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">expression</span>(fsys : symset; <span style="color: #ff00ff;">VAR</span> cx0 : <span style="color: #ff00ff;">integer</span>);
  <span style="color: #ff00ff;">VAR</span> left,right : <span style="color: #ff00ff;">integer</span>; localop : symbol;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">simpl_expr</span>(fsys : symset; <span style="color: #ff00ff;">VAR</span> cx0 : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #ff00ff;">VAR</span> left,right : <span style="color: #ff00ff;">integer</span>;

      <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">term</span>(fsys : symset; <span style="color: #ff00ff;">VAR</span> cx0 : <span style="color: #ff00ff;">integer</span>);
      <span style="color: #ff00ff;">VAR</span> left,right : <span style="color: #ff00ff;">integer</span>;

          <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">factor</span>(fsys : symset; <span style="color: #ff00ff;">VAR</span> cx0 : <span style="color: #ff00ff;">integer</span>);
          <span style="color: #ff00ff;">VAR</span> locatn0 : <span style="color: #ff00ff;">integer</span>; localop : symbol;
          tabadr : tablerange;
          ss : sortset;

          <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">factor *)</span>
          test(facbegsys,fsys,
              <span style="color: #00ff00;">'start of factor expected      '</span>);
          <span style="color: #00ffff;">WHILE</span> sym <span style="color: #00ffff;">IN</span> facbegsys <span style="color: #00ffff;">DO</span>
              <span style="color: #00ffff;">BEGIN</span>
              <span style="color: #00ffff;">CASE</span> sym <span style="color: #00ffff;">OF</span>
                  identifier :
                      <span style="color: #00ffff;">BEGIN</span>
                      lookup; locatn0 := locatn;
                      <span style="color: #00ffff;">CASE</span> table[locatn].ob <span style="color: #00ffff;">OF</span>
                          predicate_,determinate_,
                          all_det,some_det,which_det,first_det :
                            <span style="color: #00ffff;">BEGIN</span>
                            current_param := table[locatn].p_params;
                            <span style="color: #00ffff;">IF</span> table[locatn0].ob &lt; all_det <span style="color: #00ffff;">THEN</span>
                                gen(table[locatn0].ob,locatn0,
                                    table[locatn0].p_mem)
                              <span style="color: #00ffff;">ELSE</span>
                                gen(determinable_,locatn0,
                                    table[locatn0].p_mem);

                            code[cx].val := table[locatn0].p_val;
                            cx0 := cx;
                            getsym;
                            <span style="color: #00ffff;">IF</span> sym = leftparenthesis <span style="color: #00ffff;">THEN</span>
                              <span style="color: #00ffff;">BEGIN</span>
                              tuple(fsys + [rightparenthesis],cx0);
                              check(rightparenthesis,
                                [rightbrace,rightangle],
                                <span style="color: #00ff00;">'")" expected                  '</span>)
                              <span style="color: #00ffff;">END</span>;
                            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">predicate_ *)</span>
                          sort_ :
                            <span style="color: #00ffff;">BEGIN</span>
                            getsym;
                            <span style="color: #00ffff;">IF</span> sym &lt;&gt; leftparenthesis <span style="color: #00ffff;">THEN</span>
                              point(<span style="color: #00ff00;">'E'</span>,
                                <span style="color: #00ff00;">'"(" expected after sort       '</span>)
                            <span style="color: #00ffff;">ELSE</span>
                              <span style="color: #00ffff;">BEGIN</span>
                              getsym;
                              <span style="color: #00ffff;">IF</span> sym &lt;&gt; identifier <span style="color: #00ffff;">THEN</span>
                                point(<span style="color: #00ff00;">'E'</span>,
                                  <span style="color: #00ff00;">'identifier expected           '</span>)
                              <span style="color: #00ffff;">ELSE</span>
                                <span style="color: #00ffff;">BEGIN</span>
                                lookup;
                                <span style="color: #00ffff;">WITH</span> table[locatn] <span style="color: #00ffff;">DO</span> <span style="color: #00ffff;">CASE</span> ob <span style="color: #00ffff;">OF</span>
                                  individual_ :
                                    <span style="color: #00ffff;">IF</span> table[i_sortaddress].s_sort
                                        &lt;= table[locatn0].s_sort
                                      <span style="color: #00ffff;">THEN</span> gen(true_,0,0)
                                      <span style="color: #00ffff;">ELSE</span> gen(false_,0,0);
                                  all_,some_,which_,first_,the_ :
                                    gen(sort_,
                                        table[locatn].b_stackaddress,
                                        locatn0);
                                  OTHERWISE
                                    point(<span style="color: #00ff00;">'E'</span>,
                                    <span style="color: #00ff00;">'constant or variable expected '</span>)
                                  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE,WITH *)</span>
                                cx0 := cx; getsym
                                <span style="color: #00ffff;">END</span>;
                              check(rightparenthesis,
                                [rightbrace,rightangle],
                                <span style="color: #00ff00;">'")" expected                  '</span>)
                              <span style="color: #00ffff;">END</span>
                            <span style="color: #00ffff;">END</span>;
                          individual_,all_,some_,which_,first_,the_ :
                            <span style="color: #00ffff;">BEGIN</span>
                            getsym;
                            <span style="color: #00ffff;">IF</span> sym = equal <span style="color: #00ffff;">THEN</span> getsym <span style="color: #00ffff;">ELSE</span>
                              point(<span style="color: #00ff00;">'E'</span>,
                                <span style="color: #00ff00;">'"=" expected                  '</span>);
                            <span style="color: #00ffff;">IF</span> sym &lt;&gt; identifier <span style="color: #00ffff;">THEN</span>
                              point(<span style="color: #00ff00;">'E'</span>,
                                <span style="color: #00ff00;">'identifier expected           '</span>)
                            <span style="color: #00ffff;">ELSE</span>
                              <span style="color: #00ffff;">BEGIN</span>
                              lookup;
                              <span style="color: #00ffff;">WITH</span> table[locatn] <span style="color: #00ffff;">DO</span> <span style="color: #00ffff;">CASE</span> ob <span style="color: #00ffff;">OF</span>
                                individual_ :
                                  <span style="color: #00ffff;">IF</span> table[locatn0].ob = individual_
                                    <span style="color: #00ffff;">THEN</span>
                                      <span style="color: #00ffff;">IF</span> locatn = locatn0
                                        <span style="color: #00ffff;">THEN</span> gen(true_,0,0)
                                        <span style="color: #00ffff;">ELSE</span> gen(false_,0,0)
                                    <span style="color: #00ffff;">ELSE</span>
                                      gen(equalc,
                                        table[locatn0].b_stackaddress,
                                        locatn);
                                all_,some_,which_,first_,the_:
                                  <span style="color: #00ffff;">IF</span> table[locatn0].ob = individual_
                                    <span style="color: #00ffff;">THEN</span>
                                      gen(equalc,
                                        table[locatn].b_stackaddress,
                                        locatn0)
                                    <span style="color: #00ffff;">ELSE</span>
                                      gen(equal,
                                        table[locatn0].b_stackaddress,
                                        table[locatn].b_stackaddress);
                                OTHERWISE
                                  point(<span style="color: #00ff00;">'E'</span>,
                                    <span style="color: #00ff00;">'constant or variable expected '</span>)
                                <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
                              cx0 := cx; getsym
                              <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">ELSE *)</span>
                            <span style="color: #00ffff;">END</span>;
                          OTHERWISE
                            point(<span style="color: #00ff00;">'E'</span>,
                              <span style="color: #00ff00;">'identifier is of wrong kind   '</span>)
                          <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
                      <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">identifier_ *)</span>
                  all_,some_ :
                      <span style="color: #00ffff;">BEGIN</span>
                      localop := sym; top := top + 1; getsym;
                      bind(fsys + facbegsys,localop,tabadr);
                      factor(fsys,cx0); top := top - 1;
                      gen(table[tabadr].ob,tabadr,cx0); cx0 := cx
                      <span style="color: #00ffff;">END</span>;
                  true_,false_:
                      <span style="color: #00ffff;">BEGIN</span>
                      gen(sym,0,0); cx0 := cx;
                      getsym
                      <span style="color: #00ffff;">END</span>;
                  not_ :
                      <span style="color: #00ffff;">BEGIN</span>
                      getsym;
                      factor(fsys,cx0);
                      gen(not_,0,cx0); cx0 := cx
                      <span style="color: #00ffff;">END</span>;
                  leftparenthesis :
                      <span style="color: #00ffff;">BEGIN</span>
                      getsym;
                      expression(fsys + [rightparenthesis],cx0);
                      check(rightparenthesis,[rightbrace,rightangle],
                          <span style="color: #00ff00;">'")" expected                  '</span>)
                      <span style="color: #00ffff;">END</span>;
                  OTHERWISE
                      point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'start of factor expected      '</span>)
                  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
              test(fsys,[leftparenthesis],
                  <span style="color: #00ff00;">'illegal symbol after factor   '</span>)
              <span style="color: #00ffff;">END</span>;
          <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">factor *)</span>

      <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">term *)</span>
      factor(fsys + [and_],cx0);
      <span style="color: #00ffff;">IF</span> sym = and_ <span style="color: #00ffff;">THEN</span>
          <span style="color: #00ffff;">BEGIN</span>
          getsym; term(fsys,right);
          gen(and_,cx0,right); cx0 := cx
          <span style="color: #00ffff;">END</span>;
      <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">term *)</span>

    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">simpl_expr *)</span>
    term(fsys + [or_],cx0);
    <span style="color: #00ffff;">IF</span> sym = or_ <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        getsym; simpl_expr(fsys,right);
        gen(or_,cx0,right); cx0 := cx
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">simpl_expr *)</span>

  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">expression *)</span>
  simpl_expr(fsys + [iff_,imp_],cx0);
  <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> [iff_,imp_] <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">BEGIN</span>
      localop := sym; getsym; expression(fsys,right);
      gen(localop,cx0,right); cx0 := cx
      <span style="color: #00ffff;">END</span>;
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">expression *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">query</span>(fsys : symset; <span style="color: #ff00ff;">VAR</span> cx0 : <span style="color: #ff00ff;">integer</span>);
  <span style="color: #ff00ff;">VAR</span> tabadr : <span style="color: #ff00ff;">integer</span>; localop : symbol;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">query *)</span>
  <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> [which_,first_] <span style="color: #00ffff;">THEN</span>
      <span style="color: #00ffff;">BEGIN</span>
      localop := sym; top := top + 1; getsym;
      bind(fsys + querybegsys,localop,tabadr);
      query(fsys,cx0); top := top - 1;
      gen(table[tabadr].ob,tabadr,cx0); cx0 := cx
      <span style="color: #00ffff;">END</span>
  <span style="color: #00ffff;">ELSE</span> expression(fsys,cx0)
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">query *)</span>

  <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">setatom</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">called as a continuation *)</span>
  <span style="color: #ff00ff;">VAR</span> i, current_param : <span style="color: #ff00ff;">integer</span>;
  <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">setatom *)</span>
  <span style="color: #00ffff;">WITH</span> table[savelocation] <span style="color: #00ffff;">DO</span>
      <span style="color: #00ffff;">BEGIN</span> actualaddress := p_mem; current_param := p_params <span style="color: #00ffff;">END</span>;
  <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> top <span style="color: #00ffff;">DO</span>
      <span style="color: #00ffff;">BEGIN</span>
      actualaddress := actualaddress +
        paramtable[current_param].mult * bindingstack[i].add;
      current_param := current_param + 1;
      <span style="color: #00ffff;">END</span>;
  memory[actualaddress] := table[savelocation].p_val
  <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">setatom *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">top_level *)</span>
test(top_levelbegsys,fsys,<span style="color: #00ff00;">'command or query expected     '</span>);
<span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> top_levelbegsys <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">CASE</span> sym <span style="color: #00ffff;">OF</span>
    sort_ :
        <span style="color: #00ffff;">BEGIN</span>
        getsym;
        <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            enter(sort_,address);
            lastsort := lastsort + 1;
            sorttable[lastsort].tabl_ptr := address;
            getsym;
            <span style="color: #00ffff;">IF</span> sym = equal <span style="color: #00ffff;">THEN</span> getsym <span style="color: #00ffff;">ELSE</span>
                point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'"=" expected                  '</span>);
            typ(fsys + [semic],siz,ty,ss);
            sorttable[lastsort].sort_size := siz;
            <span style="color: #00ffff;">WITH</span> table[address] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                s_sortaddress := lastsort; s_size := siz; s_sort:= ss
                <span style="color: #00ffff;">END</span>;
            <span style="color: #00ffff;">IF</span> sym = semic <span style="color: #00ffff;">THEN</span> getsym
            <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE *)</span>
        <span style="color: #00ffff;">END</span>;
    predicate_ :
        <span style="color: #00ffff;">BEGIN</span>
        getsym;
        <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            enter(predicate_,address);
            getsym;
            multiplier := 1;
            <span style="color: #00ffff;">IF</span> sym = leftparenthesis <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">WITH</span> table[address] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    p_params := lastparamtable + 1; p_val := 1
                    <span style="color: #00ffff;">END</span>;
                <span style="color: #00ffff;">REPEAT</span>
                    getsym;
                    typ(fsys + [comma,rightparenthesis],siz,ty,ss);
                    lastparamtable := lastparamtable + 1;
                    <span style="color: #00ffff;">WITH</span> paramtable[lastparamtable] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        ad := ty;
                        sorts := ss;
                        firstsort := lastpartyptable + 1;
                        paramsize := 0;
                        mult := multiplier;
                        islast := sym &lt;&gt; comma
                        <span style="color: #00ffff;">END</span>;
                    adder := 0;
                    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastsort <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">IF</span> i <span style="color: #00ffff;">IN</span> ss <span style="color: #00ffff;">THEN</span>
                            <span style="color: #00ffff;">BEGIN</span>
                            <span style="color: #00ffff;">IF</span> writelisting &gt; 9 <span style="color: #00ffff;">THEN</span>
                                writeln(listing,
                                    <span style="color: #00ff00;">'type = '</span>,
                                    table[sorttable[i].tabl_ptr].alf);
                            <span style="color: #00ffff;">WITH</span> paramtable[lastparamtable] <span style="color: #00ffff;">DO</span>
                              paramsize :=
                                paramsize + sorttable[i].sort_size;
                            lastpartyptable := lastpartyptable + 1;
                            <span style="color: #00ffff;">WITH</span> partyptable[lastpartyptable] <span style="color: #00ffff;">DO</span>
                                <span style="color: #00ffff;">BEGIN</span>
                                tblptr := sorttable[i].tabl_ptr;
                                add := adder
                                <span style="color: #00ffff;">END</span>;
                            adder := adder + sorttable[i].sort_size
                            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">IF *)</span>
                    multiplier := multiplier * adder
                    <span style="color: #00ffff;">UNTIL</span> sym &lt;&gt; comma;
                <span style="color: #00ffff;">IF</span> sym = rightparenthesis <span style="color: #00ffff;">THEN</span> getsym <span style="color: #00ffff;">ELSE</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'")" expected                  '</span>);
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">IF *)</span>
              <span style="color: #00ffff;">ELSE</span>
                table[address].p_params := 0;
            <span style="color: #00ffff;">WITH</span> table[address] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span> p_mem := mx; p_info := multiplier <span style="color: #00ffff;">END</span>;
            mx := mx + multiplier;
            <span style="color: #00ffff;">IF</span> mx &gt; maxmemory <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'not enough memory             '</span>);
            <span style="color: #00ffff;">IF</span> sym = equal <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">determinable *)</span>
                getsym;
                check(leftbrace,[leftparenthesis,leftangle],
                    <span style="color: #00ff00;">'"{" expected                  '</span>);
                <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">determinate *)</span>
                    enter(determinate_,tabadr);
                    <span style="color: #00ffff;">WITH</span> table[tabadr] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        p_params := table[address].p_params;
                        p_mem := table[address].p_mem;
                        p_info := address;
                        p_val := tabadr - address  - 1
                        <span style="color: #00ffff;">END</span>;
                    getsym
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE determinate *)</span>
                <span style="color: #00ffff;">WITH</span> table[address] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    ob := determinable_;
                    p_val := tabadr-address
                    <span style="color: #00ffff;">END</span>;
                check(rightbrace,[],<span style="color: #00ff00;">'"}" expected                  '</span>)
                <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">determinable *)</span>
            <span style="color: #00ffff;">IF</span> sym = semic <span style="color: #00ffff;">THEN</span> getsym
            <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE *)</span>
        <span style="color: #00ffff;">END</span>;
    extension_ :
        <span style="color: #00ffff;">BEGIN</span>
        getsym;
        <span style="color: #00ffff;">WHILE</span> sym = identifier <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            lookup;
            <span style="color: #00ffff;">WITH</span> table[locatn] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> (ob <span style="color: #00ffff;">IN</span> [predicate_,determinate_]) <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'predicate expected            '</span>)
                  <span style="color: #00ffff;">ELSE</span>
                    savelocation := locatn;
            getsym;
            check(equal,[],<span style="color: #00ff00;">'"=" expected                  '</span>);
            check(leftbrace,[],<span style="color: #00ff00;">'"{" expected                  '</span>);
            <span style="color: #00ffff;">IF</span> sym = the_ <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                getsym;
                <span style="color: #00ffff;">IF</span> sym &lt;&gt; leftangle <span style="color: #00ffff;">THEN</span>
                    point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'"&lt;" expected                  '</span>);
                current_param :=  table[savelocation].p_params;
                lasttable := lasttable + 1; sentinel := lasttable;
                cx0 := cx + 1;
                <span style="color: #00ffff;">REPEAT</span>
                    getsym; top := top + 1;
                    bind(fsys + [comma,rightangle],the_,tabadr);
                    <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span>(table[tabadr].b_sort
                        &lt;= paramtable[current_param].sorts) <span style="color: #00ffff;">THEN</span>
                          point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'declaration has wrong type    '</span>);
                    <span style="color: #00ffff;">WITH</span> paramtable[current_param] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">IF</span> islast <span style="color: #00ffff;">AND</span> (sym = comma) <span style="color: #00ffff;">THEN</span>
                          point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'too many variables in tuple   '</span>)
                        <span style="color: #00ffff;">ELSE</span> <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> islast <span style="color: #00ffff;">AND</span> (sym &lt;&gt; comma) <span style="color: #00ffff;">THEN</span>
                          point(<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'too few variables in tuple    '</span>);
                    gen(the_,tabadr,cx + 2);
                    current_param := current_param + 1
                    <span style="color: #00ffff;">UNTIL</span> sym &lt;&gt; comma;
                check(rightangle,[],<span style="color: #00ff00;">'"&gt;" expected                  '</span>);
                expression(fsys + [rightbrace],code[cx].right);
                code[cx + 1].op := undefined;
                top := 0; indvars := 0; detvars := 0;
                num_successes := 0;
                <span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> cx <span style="color: #00ffff;">DO</span> listcode(i);
                make(true,cx0,setatom);
                lasttable := sentinel - 1
                <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">IF the *)</span>
              <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">WHILE</span> sym = leftangle <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    gen(predicate_,savelocation,
                        table[savelocation].p_mem);
                    cx0 := cx;
                    current_param := table[savelocation].p_params;
                    tuple(fsys + [rightangle],cx0);
                    <span style="color: #00ffff;">IF</span> writelisting &gt; 10 <span style="color: #00ffff;">THEN</span>
                        writeln(listing,<span style="color: #00ff00;">'setting '</span>,
                            code[cx0].right);
                    memory[code[cx0].right] :=
                        table[savelocation].p_val;
                    cx := 0;
                    check(rightangle,[rightparenthesis,rightbrace],
                        <span style="color: #00ff00;">'"&gt;" expected                  '</span>)
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE leftangle *)</span>
            check(rightbrace,[rightparenthesis,rightangle],
                <span style="color: #00ff00;">'"}" expected                  '</span>);
            <span style="color: #00ffff;">IF</span> sym = semic <span style="color: #00ffff;">THEN</span> getsym
            <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WHILE *)</span>
        <span style="color: #00ffff;">END</span>;
    show_ :
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lasttable <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">WITH</span> table[i] <span style="color: #00ffff;">DO</span>
                <span style="color: #00ffff;">BEGIN</span>
                writeresword(reswords[resword_inverse[ob]].alf);
                putch(<span style="color: #00ff00;">' '</span>);
                writeident(alf);
                <span style="color: #00ffff;">CASE</span> ob <span style="color: #00ffff;">OF</span>
                    sort_ :
                        <span style="color: #00ffff;">BEGIN</span>
                        <span style="color: #00ffff;">END</span>;
                    individual_ :
                        <span style="color: #00ffff;">BEGIN</span>
                        putch(<span style="color: #00ff00;">':'</span>);
                        writeident(table[i_sortaddress].alf)
                        <span style="color: #00ffff;">END</span>;
                    predicate_,determinable_ :
                        <span style="color: #00ffff;">BEGIN</span>
                        <span style="color: #00ffff;">IF</span> p_params &gt; 0 <span style="color: #00ffff;">THEN</span>
                            <span style="color: #00ffff;">BEGIN</span>
                            putch(<span style="color: #00ff00;">'('</span>);
                            j := p_params;
                            <span style="color: #00ffff;">REPEAT</span>
                              <span style="color: #00ffff;">WITH</span> paramtable[j] <span style="color: #00ffff;">DO</span>
                                <span style="color: #00ffff;">BEGIN</span>
                                writeident(table[ad].alf);
                                <span style="color: #00ffff;">IF</span> writelisting &gt; 5 <span style="color: #00ffff;">THEN</span>
                                  <span style="color: #00ffff;">BEGIN</span>
                                  writeset(paramtable[j].sorts);
                                  putch(<span style="color: #00ff00;">' '</span>);
                                  writeinteger(paramsize)
                                  <span style="color: #00ffff;">END</span>;
                                <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> islast <span style="color: #00ffff;">THEN</span> putch(<span style="color: #00ff00;">','</span>);
                                <span style="color: #00ffff;">IF</span> islast <span style="color: #00ffff;">THEN</span> j := 0 <span style="color: #00ffff;">ELSE</span> j := j + 1;
                                <span style="color: #00ffff;">END</span>;
                              <span style="color: #00ffff;">UNTIL</span> j = 0;
                            putch(<span style="color: #00ff00;">')'</span>); putch(<span style="color: #00ff00;">' '</span>);
                            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">IF *)</span>
                        putch(<span style="color: #00ff00;">'('</span>);  writeinteger(p_info); putch(<span style="color: #00ff00;">')'</span>);
                        writeline;
                        <span style="color: #00ffff;">FOR</span> j := p_mem <span style="color: #00ffff;">TO</span> p_mem + p_info - 1 <span style="color: #00ffff;">DO</span>
                            putch(chr(memory[j] + ord(<span style="color: #00ff00;">'0'</span>)))
                        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">predicate *)</span>
                    determinate_ :
                        <span style="color: #00ffff;">BEGIN</span>
                        putch(<span style="color: #00ff00;">' '</span>);putch(<span style="color: #00ff00;">'='</span>);putch(<span style="color: #00ff00;">' '</span>);
                        writeident(table[p_info].alf);
                        putch(<span style="color: #00ff00;">'['</span>); writeinteger(p_val); putch(<span style="color: #00ff00;">']'</span>)
                        <span style="color: #00ffff;">END</span>;
                    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
                writeline
                <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WITH, FOR *)</span>
        getsym
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">show *)</span>
    quit_ :
        <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>;
    OTHERWISE
        <span style="color: #00ffff;">BEGIN</span>
        lasttable := lasttable + 1; sentinel := lasttable;
        top := 0;
        cx := 0;
        query(fsys,cx0);
        <span style="color: #00ffff;">IF</span> errorcount &gt; 0 <span style="color: #00ffff;">THEN</span> finalise <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> writelisting &gt; 9 <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> cx <span style="color: #00ffff;">DO</span> listcode(i);
            code[cx + 1].op := undefined;
              <span style="color: #66f;">(* </span><span style="color: #66f;">see make, predicate_ NOTE *)</span>
            top := 0; indvars := 0; detvars := 0;
            num_successes := 0;
            make(true,cx0,show);
            <span style="color: #00ffff;">IF</span> num_successes = 0
                <span style="color: #00ffff;">THEN</span> writeident(<span style="color: #00ff00;">'no              '</span>)
                <span style="color: #00ffff;">ELSE</span> writeident(<span style="color: #00ff00;">'yes             '</span>);
            writeline
            <span style="color: #00ffff;">END</span>;
        lasttable := sentinel - 1; sentinel := 0;
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
test(fsys,[],<span style="color: #00ff00;">'illegal symbol after top level'</span>)
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">top_level *)</span>

<span style="color: #66f;">(* </span><span style="color: #66f;">- - - - -   M A I N   - - - - - *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writestatistics</span>(<span style="color: #ff00ff;">VAR</span> f : text);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">writestatistics *)</span>
writeln(f,calls_to_make:0,<span style="color: #00ff00;">' calls to make'</span>);
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writestatistics *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">main *)</span>
clock_start  := clock; calls_to_make := 0;
initialise;
typebegsys := [identifier,leftparenthesis];
facbegsys := [identifier,all_,some_,the_,not_,true_,false_,
                leftparenthesis,leftbrace,leftangle];
querybegsys := facbegsys + [which_,first_];
top_levelbegsys := querybegsys +
                [sort_,predicate_,extension_,show_,quit_];
table[0].ob := undefined; lasttable := 0;
<span style="color: #00ffff;">FOR</span> h := 0 <span style="color: #00ffff;">TO</span> prime_number <span style="color: #00ffff;">DO</span> hashtable[h] := 0;
lastparamtable := 0; lastsort := 0; lastpartyptable := 0; mx := 0;
10:
<span style="color: #00ffff;">REPEAT</span>
    errorcount := 0; getsym; top_level([period]);
    <span style="color: #00ffff;">UNTIL</span> false;
90: ;
99: finalise;
<span style="color: #00ffff;">IF</span> statistics &gt; 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    writestatistics(output);
    <span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span> writestatistics(listing)
    <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>.
</pre>
</div>
</div>
</div>
