19-db-query-lang.html
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Exercises and reading</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> <i>Background Reading</i> :</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Most intermediate textbooks on logic define the notions of interpretations, satisfaction of a formula, and truth of a formulas in an interpretation.  However, all the ones I know only use a single domain, because this makes the metatheory simpler.  Also, textbooks on logic invariably use just ordinary predicates, and no determinable and determinate predicates.  But if you have understood the semantics of <code>vanilla</code> predicate calculus, then the addition of sorts and the addition of determinables and determinates should not present any problems.
</p>

<p>
For some advanced references on sorts and types in logic see Eisinger and Ohlbach (1989, pp 48 - 49).  For the use of sorts to make Prolog searches more efficient, see Buekert (1989, pp 194 - 196).  Another use of types in a Prolog-like setting is described in Van Hentenryck (1989) and in Ait-Kaci and Podelski (1991).  Pletat (1991) gives a detailed description of sorts used in a natural language reasoning system and many recent references.
</p>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> <i>Syntactic Sugar - condensed binding</i>:</h3>
<div class="outline-text-3" id="text-7-2">
<p>
If one has several variables, all being bound in the same way, and all of the same type, then it is cumbersome to have to repeat the quantifier and the type for each of them.  It would be convenient to be able to write a list of comma-separated variables where currently only one variable is allowed.  For example, one could then write
</p>

<pre class="example">
ALL x,y,z : sometype  ( ... )
</pre>

<p>
Implement this alternative notation.
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> <i>Syntactic Sugar - non-identity</i>:</h3>
<div class="outline-text-3" id="text-7-3">
<p>
It is easy enough to say that two individuals are not identical, even that three individuals are not identical, but already for four individuals it becomes tedious, since one has to write
</p>

<pre class="example">
NOT (a = b OR a = c OR a = d OR b = c OR b = d OR c = d)
</pre>

<p>
To say that five individuals are all different requires 24
identity statements. In general, to say that \(N\) individuals
are different requires \((N^{2}-N)/2\) identity statements.
It would be more convenient if somehow one could just
list the individuals that are required to be different,
perhaps in the form
</p>

<pre class="example">
diff(a,b,c,d)
</pre>

<p>
This would be short for the longer formula given earlier.  Implement some notation along these lines.  Note that <code>a,b,c,d</code> can be individual constants or, more often, individual variables.
</p>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> <i>Closures</i>:</h3>
<div class="outline-text-3" id="text-7-4">
<p>
The following concerns the extensions of binary relations.  Find a way of expressing that one relation is the reflexive closure of another, or the symmetric closure of another, or the transitive closure of another.  Then implement these additions.
</p>
</div>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> <i>Functions</i>:</h3>
<div class="outline-text-3" id="text-7-5">
<p>
A function is a special kind of relation.  More precisely, an \(n\)-ary function is an \((n+1)\)-ary relation in which no \((n+1)\)-tuples differ in just their last ordinate.  Find a way of implementing functions in DATBAS.  There are two aspects to this: one is syntactic, having to allow formulas such as
</p>

<pre class="example">
knows(father(john),mother(mary))
</pre>

<p>
as semantically equivalent to
</p>

<pre class="example">
SOME f : person
  SOME m : person
    (hasfather(john,f) AND hasmother(mary,m) AND knows(f,m))
</pre>

<p>
The other aspect has to do with efficiency.  When declaring extensions, functions can be treated just like any other relation.  But it would be more efficient if functions could be explicitly declared as such.  Then the interpreter would not have to look up the value of the binary relation <code>hasfather</code> at <code>&lt;john,f&gt;</code> for all possible values of person <code>f</code>.  Instead it would look up the value of the unary function <code>father</code> at <code>&lt;john&gt;</code>.  Other kinds of formulas that become possible are
</p>

<pre class="example">
father(jane)  =  teacher(brother(paul))
</pre>
</div>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> <i>Determinables as predicates</i>:</h3>
<div class="outline-text-3" id="text-7-6">
<p>
Allow determinables as predicates, in formulas such as <code>climate(x) = climate(y)</code>.
</p>
</div>
</div>
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> <i>Sparse Memory</i> :</h3>
<div class="outline-text-3" id="text-7-7">
<p>
The memory array does not have to be implemented as a Pascal array.  Indeed, in many applications most of the entries in the array are going to be undefined or false, few will be true.  So the array may well be sparse, and then other implementation methods will be preferable to save on memory at the expense of computation time.  However, considerations of memory will only become important for large applications, and the topic is left as an exercise.
</p>
</div>
</div>
<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> <i>Constraints instead of Sorts</i> :</h3>
<div class="outline-text-3" id="text-7-8">
<p>
Bueckert (1990) uses a logic in which the variables are typed not by sorts but by constraints which can be arbitrary formulas.  For example (p 180, but changing the notation just minimally), <code>ALL x,y : (parent(x) AND child-of(y,x)) loves(x,y)</code> symbolises <code>All parents love their children</code>.  The parenthesised conjunction following the colon is the constraint.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
